Repository: jorio/gitfourchette
Catalog: gitfourchette/assets/lang/*.po
Languages: fr

source: The code may have diverged too much from this revision.
fr: Il se peut que le code ait trop divergé de cette révision.

source: Conflict resolved.
fr: Conflit résolu.

source: Merge conflict resolved in {0}.
fr: Conflit de fusion résolu dans {0}.

source: Revert patch file
fr: Inverser le fichier correctif

source: Revert
fr: Inverser

source: Apply patch file
fr: Appliquer le fichier correctif

source: Patch file
fr: Fichier correctif

source: All files
fr: Tous les fichiers

source: Do you want to {verb} patch file {path}?
fr: Voulez-vous {verb} le fichier correctif {path} ?

source: <b>{n}</b> file will be modified in your working directory:
fr: <b>{n}</b> fichier sera affecté dans votre répertoire de travail :

source: Apply patch
fr: Appliquer le correctif

source: Revert patch
fr: Inverser le correctif

source: Do you want to {verb} this patch?
fr: Voulez-vous {verb} ce correctif ?

# preposition slotted into '...BEFORE this commit'
source: before
fr: avant

# preposition slotted into '...AT this commit'
source: at
fr: à

source: Your working copy of {path} already matches the revision {preposition} this commit.
fr: Votre copie de travail de {path} se trouve déjà dans le même état qu’{preposition} ce commit.

source: recreated
fr: recréé

source: deleted
fr: supprimé

source: overwritten
fr: écrasé

source: Do you want to restore {path} as it was {preposition} this commit?
fr: Voulez-vous rétablir {path} à l’état dans lequel il se trouvait {preposition} ce commit ?

source: This file will be {processed} in your working directory.
fr: Ce fichier sera {processed} dans votre copie de travail.

source: Restore
fr: Rétablir

source: File {path} {processed}.
fr: Fichier {path} {processed}.

source: No abortable state is in progress.
fr: L’état actuel du dépôt ne peut pas être interrompu.

source: Abort
fr: Abandonner

source: abort the ongoing cherry-pick
fr: abandonner le picorage en cours

source: Cherry-pick aborted.
fr: Picorage abandonné.

source: abort the ongoing merge
fr: abandonner la fusion en cours

source: Merge aborted.
fr: Fusion abandonnée.

source: abort the ongoing revert
fr: abandonner l’inversion en cours

source: Revert aborted.
fr: Inversion abandonnée.

source: reset the index
fr: réinitialiser l’index

source: Reset
fr: Réinitialiser

source: Index reset.
fr: Index réinitialisé.

source: Cannot {verb} right now, because a file contain both staged and unstaged changes.
fr: Impossible de {verb} pour l’instant car un fichier comprend des modifications indexés et non-indexées.

source: Do you want to {0}?
fr: Voulez-vous {0} ?

source: No files are affected.
fr: Aucun fichier n’est affecté.

source: All conflicts will be cleared and all <b>staged</b> changes will be lost.
fr: Tous les conflits seront effacés et toutes vos modifications <b>indexées</b> seront perdues.

source: All <b>staged</b> changes will be lost.
fr: Toutes les modifications <b>indexées</b> seront perdues.

source: This file will be reset:
fr: Ce fichier sera réinitialisé :

source: Unstaged ({n})
fr: Non-indexé ({n})

source: Staged ({n})
fr: Indexé ({n})

source: Commit {n} file
fr: Committer {n} fichier

source: Working directory clean|Workdir clean
fr: Répertoire de travail propre|Rép. de travail propre|Rép. propre

source: The working directory is clean.
fr: Le répertoire de travail est propre.

source: There aren’t any changes to commit.
fr: Il n’y a aucune modification à committer.

source: Shallow clone – End of available history.
fr: Clone superficiel (shallow) – Fin de l’historique disponible.

source: More commits may be available in a full clone.
fr: Davantage de commits pourraient être disponibles dans un clone complet.

source: [Load full commit history] (this may take a moment)
fr: [Charger l’historique de commits en entier] (cela peut prendre un certain temps)

source: [Change threshold setting] (currently {0} commits)
fr: [Paramétrer le seuil] (actuellement {0} commits)

source: History truncated to {0} commits.
fr: Historique tronqué à {0} commits.

source: More commits may be available.
fr: Davantage de commits pourraient être disponibles.

source: History truncated
fr: Historique tronqué

source: Unknown reference {0}.
fr: Référence {0} inconnue.

source: {n} change:|{n} ch.:
fr: {n} modification :|{n} modif :

source: This commit is empty.
fr: Ce commit est vide.

source: Commit {0} doesn’t affect any files.
fr: Le commit {0} n’affecte aucun fichier.

source: Rename detection was skipped to load this large commit faster.
fr: Afin d’accélérer le chargement de ce commit volumineux, les renommages n’ont pas été détectés.

source: {n} rename detected.
fr: {n} renommage détecté.

source: Detect Renames
fr: Détecter renommages

source: {0} commits (truncated log).
fr: {0} commits (historique tronqué).

source: {0} commits total.
fr: {0} commits en tout.

source: Try to reload the file.
fr: Essayez de recharger le fichier.

source: Consider re-enabling [{0}] to prevent this issue.
fr: Envisagez de réactiver [{0}] pour éviter ce problème.

source: Outdated diff.
fr: Diff obsolète.

source: The file appears to have changed on disk.
fr: Le fichier semble avoir été modifié par une autre application.

source: Patch has no delta!
fr: Le patch n’a pas de delta !

# at (specific commit)
source: at {0}
fr: à {0}

source: You’re working in a shallow clone. This commit may actually have parents in the full history.
fr: Vous travaillez dans un clone superficiel. Il se peut que ce commit ait des parents dans l’historique complet.

source: (same as author)
fr: (identique à l’auteur)

source: Hash
fr: Hachage

source: Author
fr: Auteur

source: Committer
fr: Committeur

source: Commit info: {0}
fr: Infos sur le commit : {0}

source: Can’t fetch new commits on {0} because this branch isn’t tracking an upstream branch.
fr: Impossible de récupérer les nouveaux commits de {0} car cette branche ne suit pas de branche amont.

source: Really delete branch {0} from the remote repository?
fr: Êtes-vous sûr de supprimer la branche {0} sur le serveur distant ?

source: The remote branch will disappear for all users of remote {1}.
fr: La branche distante disparaîtra pour tous les utilisateurs du serveur {1}.

source: Delete on remote
fr: Supprimer du serveur

source: Remote branch {0} deleted.
fr: Branche distante {0} supprimée.

source: Rename remote branch {0}
fr: Renommer la branche distante {0}

source: WARNING: This will rename the branch for all users of the remote!
fr: ATTENTION : La branche sera renommée pour tous les utilisateurs du serveur !

source: Rename on remote
fr: Renommer sur le serveur

source: Remote branch {0} renamed to {1}.
fr: Branche distante {0} renommée {1}.

source: To fetch remote branches, you must first add a remote to your repo.
fr: Pour récupérer des branches distantes (fetch), vous devez d’abord ajouter un serveur à votre dépôt.

source: You can do so via <i>“Repo &rarr; Add Remote”</i>.
fr: Pour ce faire, allez dans <i>“Dépôt &rarr; Ajouter un serveur”</i>.

source: Fetch remote {0}
fr: Récupérer les nouveaux commits de {0}

source: Fetch {n} remotes
fr: Récupérer {n} serveurs

source: Fetch complete.
fr: Récupération terminée.

source: Couldn’t fetch remote:
fr: Les commits n’ont pas pu être récupérés sur le serveur :

source: Fetch remote branch {0}
fr: Récupérer la branche distante {0}

source: No new commits on {0}.
fr: Pas de nouveau commit sur {0}.

source: {0} has disappeared from the remote server.
fr: {0} a disparu du serveur distant.

source: Can’t pull new commits into {0} because this branch isn’t tracking an upstream branch.
fr: Impossible de tirer de nouveaux commits dans {0} car cette branche ne suit pas de branche amont.

source: Submodule updated.
fr: Sous-module mis à jour.

source: To push a local branch to a remote, you must first add a remote to your repo.
fr: Pour publier (push) une branche locale sur un serveur, vous devez d’abord ajouter un serveur à votre dépôt.

source: Please switch to a local branch before performing this action.
fr: Veuillez basculer dans une branche locale avant d’appeler cette commande.

source: Push complete.
fr: Publication terminée.

source: Remote {0} added.
fr: Serveur {0} ajouté.

source: Really remove remote {0}?
fr: Êtes-vous sûr d’oublier le serveur distant {0} ?

source: This will merely detach the remote from your local repository. The remote server itself will not be affected.
fr: Cela ne fera que détacher le serveur de votre dépôt local. Le serveur lui-même ne sera pas affecté.

source: Remove remote
fr: Oublier le serveur

source: Remote {0} removed.
fr: Serveur {0} oublié.

source: Conflicting file
fr: Fichier en conflit

# operation conflicts with…
source: a file
fr: un fichier

source: Operation {op} conflicts with {files} in the working directory:
fr: L’opération {op} est en conflit avec {files} du répertoire de travail :

source: Operation {op} conflicts with {files} in the commit at HEAD:
fr: L’opération {op} est en conflit avec {files} du commit en HEAD :

source: Operation {op} has caused a conflict with {files} ({exc}):
fr: L’opération {op} a provoqué un conflit avec {files} ({exc}) :

source: Before you try again, you should either commit, stash, or discard your changes.
fr: Avant de réessayer, vous devriez committer, remiser, ou encore jeter vos modifications.

source: Operation failed: {0}.
fr: Échec de l’opération : {0}.

source: Don’t ask me to confirm this again
fr: Ne plus me demander de confirmer ceci

source: Don’t show this again
fr: Ne plus afficher ceci

source: Fix merge conflicts before performing this action.
fr: Résolvez les conflits de fusion avant d’effectuer cette action.

source: There are no commits in this repository yet.
fr: Il n’y a encore aucun commit dans ce dépôt.

source: Create the initial commit in this repository before performing this action.
fr: Créez le commit initial dans ce dépôt avant d’effectuer cette action.

source: You are in “detached HEAD” state.
fr: Vous êtes en l’état “HEAD détachée”.

source: You are in the middle of a cherry-pick.
fr: Vous êtes en plein picorage.

source: Before performing this action, conclude the cherry-pick.
fr: Avant d’effectuer cette action, concluez le picorage.

source: You have staged changes.
fr: Vous avez des modifications indexées.

source: Before performing this action, commit your changes or stash them.
fr: Avant d’effectuer cette action, committez vos modifications, ou remisez-les.

source: Please wait for the current operation to complete ({0}).
fr: Veuillez attendre la fin de l’opération en cours ({0}).

source: Operation in progress
fr: Opération en cours

source: Busy: {0}…
fr: En cours : {0}…

source: There are no uncommitted changes to stash.
fr: Il n’y a aucune modification non-committée à remiser.

source: There are no uncommitted changes to stash (submodules cannot be stashed).
fr: Il n’y a aucune modification non-commitée à remiser (les sous-modules ne peuvent pas être remisés).

source: File stashed.
fr: Fichier remisé.

source: Do you want to apply the changes stashed in {0} to your working directory?
fr: Voulez-vous appliquer les modifications remisées dans {0} à votre répertoire de travail ?

source: &Apply && Delete
fr: &Appliquer && jeter

source: &Apply && Keep
fr: &Appliquer && conserver

source: &Delete the stash if it applies cleanly
fr: &Jeter la remise si elle s’applique proprement

source: Stash {0} applied.
fr: Remise {0} appliquée.

source: Stash {0} applied, with conflicts.
fr: Remise {0} appliquée, avec conflits.

source: Applying the stash {0} has caused merge conflicts because your files have diverged since they were stashed.
fr: L’application de la remise {0} a provoqué un conflit de fusion car vos fichiers ont divergé depuis qu’ils ont été remisés.

source: The stash wasn’t deleted in case you need to re-apply it later.
fr: La remise n’a pas été supprimée au cas où vous ayez besoin de la réappliquer plus tard.

source: Conflicts caused by stash application
fr: Conflits provoqués par l’application de la remise

source: Stash {0} applied and deleted.
fr: Remise {0} appliquée et supprimée.

source: Really delete stash {0}?
fr: Êtes-vous sûr de supprimer la remise {0} ?

source: Delete stash
fr: Supprimer la remise

source: Stash {0} deleted.
fr: Remise {0} supprimée.

source: {0} has no remotes.
fr: Aucun serveur n’est rattaché à {0}.

source: Please open {0} and add a remote to it before absorbing it as a submodule.
fr: Veuillez ouvrir {0} et ajoutez-y un serveur avant de l’absorber comme sous-module.

source: Settings will be saved in {0}
fr: Ces paramètres seront stockés dans {0}

source: Really remove submodule {0}?
fr: Êtes-vous sûr de supprimer le sous-module {0} ?

source: The submodule will be removed from {1} and its working copy will be deleted.
fr: Le sous-module sera retiré de {1} et sa copie de travail sera supprimée.

source: Any changes in the submodule that haven’t been pushed will be lost.
fr: Toute modification au sous-module qui n’a pas été publiée sera perdue.

source: Accept merge conflict resolution
fr: Accepter la résolution du conflit de fusion

source: Amend last commit
fr: Rectifier le dernier commit

source: Apply selected text
fr: Appliquer le texte sélectionné

source: Apply stash
fr: Appliquer la remise

source: Check out commit
fr: Basculer dans le commit

source: Cherry-pick
fr: Picorer

source: Delete local branch
fr: Supprimer la branche locale

source: Delete local branch folder
fr: Supprimer le dossier de branches locales

source: Delete branch on remote
fr: Supprimer la branche sur le serveur

source: Delete tag
fr: Supprimer l’étiquette

source: Discard files
fr: Rejeter fichiers

source: Edit upstream branch
fr: Modifier la branche amont

source: Export commit as patch file
fr: Exporter un correctif à partir du commit

source: Export patch file
fr: Exporter un fichier correctif

source: Export stash as patch file
fr: Exporter un correctif à partir de la remise

source: Export changes as patch file
fr: Exporter un correctif à partir des modifs

source: Fast-forward branch
fr: Avance-rapide sur la branche

source: Fetch remotes
fr: Récupérer les branches distantes (fetch)

source: Fetch remote branch
fr: Récupérer la branche distante (fetch)

source: Get commit information
fr: Obtenir des informations sur le commit

source: Accept/reject incoming changes
fr: Accepter/rejeter les modifications entrantes

source: Navigate in repo
fr: Naviguer dans le dépôt

source: Navigate back
fr: Naviguer en arrière

source: Navigate forward
fr: Naviguer en avant

source: Go to HEAD commit
fr: Aller au commit en HEAD

source: Load commit
fr: Charger le commit

source: Load diff
fr: Charger la diff

source: Refresh working directory
fr: Rafraîchir le répertoire de travail

source: Mark conflict solved
fr: Marquer le conflit comme résolu

source: Merge branch
fr: Fusionner la branche

source: New local branch
fr: Nouvelle branche locale

source: New commit
fr: Nouveau commit

source: Stash changes
fr: Remiser les modifications

source: New tag
fr: Nouvelle étiquette

source: Open repo
fr: Ouvrir le dépôt

source: Pull remote branch
fr: Tirer depuis la branche distante

source: Push branch
fr: Publier la branche (push)

source: Push refspecs
fr: Publier les refspecs

source: Refresh repo
fr: Rafraîchir le dépôt

source: Remove submodule
fr: Supprimer le sous-module

source: Rename local branch folder
fr: Renommer le dossier de branches locales

source: Rename branch on remote
fr: Renommer la branche sur le serveur

source: Reset HEAD
fr: Déplacer HEAD

source: Restore file revision
fr: Rétablir une révision du fichier

source: Revert commit
fr: Inverser le commit

source: Revert selected text
fr: Inverser le texte sélectionné

source: Git identity
fr: Identité Git

source: Repository settings
fr: Paramètres du dépôt

source: Stage files
fr: Indexer fichiers

source: Switch to branch
fr: Basculer dans la branche

source: Update submodule
fr: Mettre à jour le sous-module

source: Unstage files
fr: Désindexer fichiers

source: Unstage mode changes
fr: Désindexer changement de mode

# toolbar
source: Amend
fr: Rectifier

# toolbar
source: Fetch
fr: Récupérer

# toolbar
source: Back
fr: Reculer

# toolbar
source: Forward
fr: Avancer

# toolbar
source: Changes
fr: Modifs

# toolbar
source: Branch
fr: Branche

# toolbar
source: Stash
fr: Remiser

# toolbar
source: Pull
fr: Tirer

# toolbar
source: Push
fr: Publier

source: Amend the last commit on the current branch with the staged changes in the working directory
fr: Rectifier le dernier commit de la branche courante avec les modifications indexées dans le répertoire de travail

source: Apply a patch file to the working directory
fr: Appliquer un fichier correctif au répertoire de travail

source: Apply a patch file to the working directory (reverse patch before applying)
fr: Appliquer un fichier correctif au répertoire de travail (inverser le correctif avant application)

source: Restore backed up changes to the working directory
fr: Restaurer des modifications remisées et les appliquer au répertoire de travail

source: Bring the changes introduced by this commit to the current branch
fr: Rapatrier les modifications de ce commit dans la branche courante

source: Delete this branch locally
fr: Supprimer cette branche localement

source: Choose the remote branch to be tracked by this local branch
fr: Sélectionner la branche distante que cette branche locale doit suivre

source: Create a patch file from this stash
fr: Créer un fichier correctif à partir de cette remise

source: Advance this local branch to the tip of the remote-tracking branch
fr: Avancer cette branche locale jusqu’à l’extrémité de la branche distante

source: Get the latest commits on all remote branches
fr: Obtenir les derniers commits sur toutes les branches distantes

source: Get the latest commits from the remote server
fr: Obtenir les derniers commits du serveur

source: Start a new branch from this commit
fr: Créer une nouvelle branche partant de ce commit

source: Start a new branch from the current HEAD
fr: Créer une nouvelle branche partant de la HEAD actuelle

source: Start a new branch from the tip of this branch
fr: Créer une nouvelle branche partant de l’extrémité de cette branche

source: Create a commit of the staged changes in the working directory
fr: Créer un commit à partir des modifications indexées dans le répertoire de travail

source: Add a remote server to this repo
fr: Ajouter un serveur à ce dépôt

source: Back up uncommitted changes and clean up the working directory
fr: Sauvegarder les modifications non-committées puis nettoyer le répertoire de travail

source: Tag this commit with a name
fr: Étiqueter ce commit avec un nom

source: Fetch the latest commits from the remote, then integrate them into your local branch
fr: Récupérer les derniers commits sur le serveur, puis les intégrer à votre branche locale

source: Upload your commits on the current branch to the remote server
fr: Envoyer vos commits de la branche courante vers le serveur distant

source: Remove this submodule from .gitmodules and delete its working copy from this repo
fr: Retirer ce sous-module de .gitmodules et supprimer sa copie de travail de ce dépôt

source: Rename this branch locally
fr: Renommer cette branche localement

source: Make HEAD point to another commit
fr: Faire pointer HEAD sur un autre commit

source: Revert the changes introduced by this commit
fr: Inverser les modifications introduites par ce commit

source: Set up the identity under which you create commits
fr: Établir l’identité sous laquelle vous créez des commits

source: Switch to this branch and update the working directory to match it
fr: Basculer dans cette branche et mettre à jour le répertoire de travail pour qu’il corresponde à cette branche

source: No repository
fr: Aucun dépôt

source: Unhandled exception
fr: Exception non-gérée

source: An exception was raised.
fr: Une exception a été levée.

source: (MESSAGE TRUNCATED)
fr: (MESSAGE TRONQUÉ)

source: If you want to file a bug report, please click “Show Details” and copy the <b>entire</b> message.
fr: Si vous souhaitez rapporter un bug, veuillez cliquer sur “Montrer les détails” et copiez <b>tout</b> le message.

source: Quit application
fr: Quitter l’application

source: Skip {n} more error
fr: Passer {n} autre erreur

source: …and {0} more. Click “Show Details” to view all.
fr: …et {0} autres. Cliquez sur “Montrer les détails” pour tout afficher.

# button to open a file browser to select a file
source: Select…
fr: Choisir…

source: Help
fr: Aide

source: List all tabs
fr: Liste de tous les onglets

source: {0} copied to clipboard.
fr: {0} copié dans le presse-papiers.

source: {n} lines copied to clipboard.
fr: {n} lignes copiées dans le presse-papiers.

source: …and {0} more
fr: …et {0} autres

source: Placeholder token {0} missing.
fr: Le symbole de substitution {0} est manquant.

source: Name validation error {0}
fr: Échec de la validation du nom {0}

source: Connection refused
fr: Connexion refusée

source: File not found
fr: Fichier introuvable

source: Permission denied
fr: Permission refusée

source: Git error
fr: Erreur Git

source: Unsupported feature
fr: Fonctionnalité non prise en charge

source: Illegal name.
fr: Nom invalide.

source: Illegal suffix.
fr: Suffixe invalide.

source: Illegal prefix.
fr: Préfixe invalide.

source: Contains illegal character sequence.
fr: Contient une séquence de caractères invalide.

source: Contains illegal character.
fr: Contient un caractère invalide.

source: This name is discouraged for compatibility with Windows.
fr: Ce nom est découragé pour la compatibilité avec Windows.

source: This name is already taken.
fr: Ce nom est déjà pris.

source: This name is already taken by a folder.
fr: Ce nom est déjà pris par un dossier.

# SidebarModel
source: Uncommitted Changes|Changes
fr: Modifications non-committées|Modifs non-committées|Modifications|Modifs

# SidebarModel
source: Local Branches|Branches
fr: Branches locales|Branches

# SidebarModel
source: Stashes
fr: Remises

# SidebarModel
source: Remotes
fr: Serveurs

# SidebarModel
source: Tags
fr: Étiquettes

# SidebarModel
source: Submodules
fr: Sous-modules

# SidebarModel
source: Local branch
fr: Branche locale

# SidebarModel
source: Detached HEAD
fr: HEAD détachée

# SidebarModel
source: Unborn HEAD
fr: HEAD non-née

# SidebarModel
source: Remote branch
fr: Branche distante

# SidebarModel
source: Stash
fr: Remise

# SidebarModel
source: Remote
fr: Serveur

# SidebarModel
source: Tag
fr: Étiquette

# FileStatus
source: added
fr: ajouté

# FileStatus
source: copied
fr: copié

# FileStatus
source: deleted
fr: supprimé

# FileStatus
source: ignored
fr: ignoré

# FileStatus
source: modified
fr: modifié

# FileStatus
source: renamed
fr: renommé

# FileStatus
source: file type changed
fr: type de fichier changé

# FileStatus
source: merge conflict
fr: conflit de fusion

# FileStatus
source: unreadable
fr: illisible

# FileStatus
source: untracked
fr: non-suivi

# FileMode
source: deleted
fr: supprimé

# FileMode
source: regular file
fr: fichier ordinaire

# FileMode
source: executable file
fr: fichier exécutable

# FileMode
source: symbolic link
fr: lien symbolique

# FileMode
source: subtree
fr: sous-arbre

# FileMode
source: subtree commit
fr: commit de sous-arbre

# RepositoryState
source: None
fr: Aucun

# RepositoryState
source: Merging
fr: Fusion en cours

# RepositoryState
source: Reverting
fr: Inversion en cours

# RepositoryState
source: Reverting (sequence)
fr: Inversion (séquence) en cours

# RepositoryState
source: Cherry-picking
fr: Picorage en cours

# RepositoryState
source: Cherry-picking (sequence)
fr: Picorage (séquence) en cours

# RepositoryState
source: Bisecting
fr: Bissection en cours

# RepositoryState
source: Rebasing
fr: Rebasage en cours
