Repository: jorio/gitfourchette
Catalog: gitfourchette/assets/lang/*.po
Languages: fr

# RepositoryState
source: Rebasing (interactive)
fr: Rebasage (interactif) en cours

# RepositoryState
source: Rebasing (merging)
fr: Rebasage (fusion) en cours

# PatchPurpose
source: Stage
fr: Indexer

# PatchPurpose
source: Unstage
fr: Désindexer

# PatchPurpose
source: Discard
fr: Jeter

# PatchPurpose
source: Stage lines
fr: Indexer les lignes

# PatchPurpose
source: Unstage lines
fr: Désindexer les lignes

# PatchPurpose
source: Discard lines
fr: Jeter les lignes

# PatchPurpose
source: Stage hunk
fr: Indexer la section

# PatchPurpose
source: Unstage hunk
fr: Désindexer la section

# PatchPurpose
source: Discard hunk
fr: Jeter la section

# PatchPurpose
source: Stage file
fr: Indexer le fichier

# PatchPurpose
source: Unstage file
fr: Désindexer le fichier

# PatchPurpose
source: Discard file
fr: Jeter le fichier

# PatchPurpose
source: Staged.
fr: Indexé.

# PatchPurpose
source: Unstaged.
fr: Désindexé.

# PatchPurpose
source: Discarded.
fr: Jeté.

# PatchPurpose
source: Lines staged.
fr: Lignes indexées.

# PatchPurpose
source: Lines unstaged.
fr: Lignes désindexées.

# PatchPurpose
source: Lines discarded.
fr: Lignes jetées.

# PatchPurpose
source: Hunk staged.
fr: Section indexée.

# PatchPurpose
source: Hunk unstaged.
fr: Section désindexée.

# PatchPurpose
source: Hunk discarded.
fr: Section jetée.

# PatchPurpose
source: File staged.
fr: Fichier indexé.

# PatchPurpose
source: File unstaged.
fr: Fichier désindexé.

# PatchPurpose
source: File discarded.
fr: Fichier jeté.

# Prefs
source: General
fr: Général

# Prefs
source: Code Diff
fr: Diff de code

# Prefs
source: Image Diff
fr: Diff d’image

# Prefs
source: Tabs
fr: Onglets

# Prefs
source: Commit History
fr: Historique commits

# Prefs
source: Trash
fr: Poubelle

# Prefs
source: External Tools
fr: Outils externes

# Prefs
source: Advanced
fr: Expert

source: Language
fr: Langue

source: Theme
fr: Thème

source: Shorten hashes to # characters
fr: Abréger les hachages à # caractères

source: Date/time format
fr: Format date/heure

source: Path display style
fr: Affichage des chemins

source: Author display style
fr: Affichage des auteurs

source: Remember up to # recent repositories
fr: Mémoriser jusqu’à # dépôts récents

source: When the menu bar is hidden, press the Alt key to show it again.
fr: Une fois la barre de menus cachée, appuyez sur Alt pour la rétablir.

source: Restore all “don’t show this again” messages
fr: Rétablir tous les messages “ne plus afficher ceci”

source: Middle-click a file name to stage/unstage the file
fr: Clic molette sur un nom de fichier pour l’indexer/le désindexer

source: One tab is # spaces
fr: Une tabulation vaut # espaces

source: Show up to # context lines
fr: Afficher jusqu’à # lignes de contexte

source: Amount of unmodified lines to show around red or green lines in a diff.
fr: Nombre de lignes non-modifiées à afficher autour des lignes rouges et vertes dans une diff.

source: Load diffs up to # KB
fr: Charger les diffs jusqu’à # Ko

source: Load images up to # KB
fr: Charger les images jusqu’à # Ko

source: Word wrap
fr: Retour à la ligne automatique

source: Display alien line endings (CRLF)
fr: Afficher les fins de ligne étrangères (CRLF)

source: Colorblind-friendly color scheme
fr: Couleurs adaptées aux daltoniens (rouge-vert)

source: Tick this if you have trouble distinguishing red and green. The diff will use a yellow and blue color scheme instead.
fr: Cochez ceci si vous avez des difficultés à distinguer le rouge et le vert. La diff utilisera alors une palette de couleurs jaune et bleue.

source: Treat SVG files as
fr: Traiter les fichiers SVG comme

source: Show tab close button
fr: Orner les onglets d’un bouton de fermeture

source: Expand tabs to available width
fr: Étaler les onglets sur la largeur de la fenêtre

source: Auto-hide tabs if only one repo is open
fr: Masquer les onglets si un seul dépôt est ouvert

source: Double-click a tab to open repo folder
fr: Double-cliquer un onglet pour ouvrir le dossier du dépôt

source: Sort commits
fr: Trier les commits

source: Chronologically
fr: Par ordre chronologique

source: Topologically
fr: Par ordre topologique

source: <b>Chronological mode</b> lets you stay on top of the latest activity in the repository. The most recent commits always show up at the top of the graph. However, the graph can get messy when multiple branches receive commits in the same timeframe.
fr: Le <b>tri chronologique</b> vous permet de garder un œil sur l’activité la plus récente dans le dépôt. Les commits les plus récents apparaîtront toujours en haut du graphe. Toutefois, le graphe peut avoir tendance à devenir fouillis lorsque plusieurs branches reçoivent des commits dans le même laps de temps.

source: <b>Topological mode</b> makes the graph easier to read. It attempts to present sequences of commits within a branch in a linear fashion. Since this is not a strictly chronological mode, you may have to do more scrolling to see the latest changes in various branches.
fr: Le <b>tri topologique</b> facilite la lecture du graphe. Ce mode tente de présenter les séquences de commits au sein d’une branche de manière linéaire. Vu que ce tri ne respecte pas strictement la chronologie réelle des commits, il se peut que vous deviez davantage faire défiler le graphe pour voir les toutes dernières modifications apportées aux différentes branches.

source: Row spacing
fr: Espacement des lignes

source: Squeeze branch lanes in graph
fr: Aplatir les “files” des branches dans le graphe

source: Mark author/committer signature differences
fr: Indiquer les différences de signature entre l’auteur et le committeur

source: The commit history displays information about a commit’s <b>author</b>—their name and the date at which they made the commit. But in some cases, a commit might have been revised by someone else than the original author—this person is called the <b>committer</b>.
fr: L’historique de commits affiche des informations sur l’<b>auteur</b> d’un commit : son nom et la date à laquelle il a créé le commit. Cependant, dans certains cas, un commit peut avoir été révisé par quelqu’un d’autre que l’auteur d’origine &ndash; cette personne est appelée le <b>committeur</b>.

source: If you tick this option, an asterisk (*) will appear after the author’s name and/or date if they differ from the committer’s for any given commit.
fr: Si vous cochez cette option, un astérisque (*) apparaîtra après le nom ou la date de l’auteur si ces données diffèrent de celles du committeur pour un commit donné.

source: Note that you can always hover over the author’s name or date to obtain detailed information about the author and the committer.
fr: Notez que vous pouvez toujours passer la souris sur le nom ou la date d’un commit pour obtenir des informations détaillées sur l’auteur et le committeur.

source: Load up to # commits in the history
fr: Charger jusqu’à # commits dans l’historique

source: Set to 0 to always load the full commit history.
fr: Mettez 0 si vous souhaitez toujours charger l’historique de commits dans son intégralité.

source: Draw rows using alternating background colors
fr: Alterner la couleur de fond de chaque ligne

source: The trash keeps up to # discarded patches
fr: La poubelle conserve jusqu’à # modifications rejetées

source: Patches bigger than # KB won’t be salvaged
fr: Les modifications excédant # Ko ne seront pas sauvées

source: When you discard changes from the working directory, {app} keeps a temporary copy in a hidden “trash” folder. This gives you a last resort to rescue changes that you have discarded by mistake. You can look around this trash folder via <i>“Help &rarr; Open Trash”</i>.
fr: Lorsque vous jetez des modifications dans le répertoire de travail, {app} en conserve une copie temporaire dans un dossier caché “poubelle”. Cela vous donne une dernière chance de récupérer des modifications que vous auriez jetées par erreur. Vous pouvez examiner ce dossier poubelle via <i>“Aide &rarr; Ouvrir la poubelle à modifs”</i>.

source: Logging verbosity
fr: Verbosité du journal

source: Auto-refresh when app regains focus
fr: Auto-rafraîchir lorsque l’application reprend la main

source: Animation effects
fr: Effets d’animation

source: Smooth scrolling (where applicable)
fr: Défilement doux (le cas échéant)

source: Preferred Qt binding
fr: Binding Qt à privilégier

source: After restarting, {app} will use this Qt binding if available.
fr: Au prochain démarrage de {app}, ce binding Qt sera privilégié si disponible.

source: You can also pass the name of a Qt binding via the “QT_API” environment variable.
fr: Vous pouvez également passer le nom d’un binding Qt via la variable d’environnement “QT_API”.

source: Text editor
fr: Éditeur texte

source: Argument placeholders: <code>$L</code> - Old/Left <code>$R</code> - New/Right
fr: Arguments qui seront substitués : <code>$L</code> - Ancienne version / Gauche <code>$R</code> - Nouvelle version / Droite

source: Argument placeholders: <code>$B</code> - Ancestor / Base / Center <code>$L</code> - Ours / Local / Left <code>$R</code> - Theirs / Remote / Right <code>$M</code> - Merged / Output / Result
fr: Arguments qui seront substitués : <code>$B</code> - Ancêtre / Base / Centre <code>$L</code> - Notre version / Locale / Gauche <code>$R</code> - Leur version / Distante / Droite <code>$M</code> - Version fusionnée / Sortie / Résultat

source: Full paths
fr: Chemins complets

source: Abbreviate directories
fr: Abréger répertoires

source: Show filename only
fr: Nom de fichier seulement

source: Full name
fr: Nom complet

source: First name
fr: Prénom

source: Last name
fr: Nom de famille

source: Initials
fr: Initiales

source: Full email
fr: Courriel complet

source: Abbreviated email
fr: Courriel abrégé

# row spacing
source: Cramped
fr: Exigu

# row spacing
source: Tight
fr: Serré

# row spacing
source: Relaxed
fr: Détendu

# row spacing
source: Roomy
fr: Ample

# row spacing
source: Spacious
fr: Spacieux

# Qt binding
source: Automatic (recommended)
fr: Automatique (recommandé)

# ConflictSides
source: modified by both sides
fr: modifié de part et d’autre

# ConflictSides
source: deleted by us
fr: supprimé par nous

# ConflictSides
source: deleted by them
fr: supprimé par eux

# ConflictSides
source: deleted by both sides
fr: supprimé de part et d’autre

# ConflictSides
source: added by us
fr: ajouté par nous

# ConflictSides
source: added by them
fr: ajouté par eux

# ConflictSides
source: added by both sides
fr: ajouté de part et d’autre
