Repository: jorio/gitfourchette
Catalog: gitfourchette/assets/lang/*.po
Languages: fr

source: Settings
fr: Réglages

source: Configure {app}
fr: Configurer {app}

source: Text Position
fr: Position du texte

source: Icons Only
fr: Icônes seulement

source: Text Only
fr: Texte seulement

source: Text Alongside Icons
fr: Texte à côté des icônes

source: Text Under Icons
fr: Texte en-dessous des icônes

source: Icon Size
fr: Taille des icônes

source: Small
fr: Petites

source: Medium
fr: Moyennes

source: Large
fr: Grandes

source: Huge
fr: Géantes

source: &Create
fr: &Créer

source: (blocked by conflicts)
fr: (empêché par des conflits)

source: This name is already taken by another local branch.
fr: Ce nom est déjà pris par une autre branche locale.

source: New branch
fr: Nouvelle branche

source: Commit at tip:
fr: Commit à la pointe de la branche :

source: No Remotes
fr: Aucun serveur

source: All Remotes
fr: Tous les serveurs

source: &Create && Push
fr: &Créer && publier

source: This name is already taken by another tag.
fr: Ce nom est déjà pris par une autre étiquette.

source: New tag on commit {0}
fr: Étiqueter le commit {0}

source: Opening {0}…
fr: Ouverture de {0}…

source: {app} Settings
fr: Réglages de {app}

source: Text
fr: Texte

# system default language setting
source: System default
fr: Automatique

source: Font
fr: Police

# reset font to default
source: Reset
fr: Réinitialiser

# default font
source: Default
fr: Par défaut

# hint user to leave the field blank
source: leave blank
fr: laisser vide

source: Leave blank for system default.
fr: Laisser vide pour que le système choisisse automatiquement.

# system default theme setting
source: System default
fr: Automatique

source: Change URL protocol
fr: Changer le protocole de l’URL

source: tracking {0}
fr: suit {0}

source: non-tracking
fr: ne suit rien

source: {0} will track {1}.
fr: {0} suivra {1}.

source: {0} currently does not track any remote branch.
fr: {0} ne suit actuellement pas de branche distante.

source: {0} already tracks remote branch {1}.
fr: {0} suit déjà la branche distante {1}.

source: {0} will track {1} instead of {2}.
fr: {0} suivra {1} au lieu de {2}.

source: {0} currently tracks {1}.
fr: {0} suit actuellement {1}.

source: [tracked]
fr: [suivie]

source: New remote branch on {0}
fr: Nouvelle branche distante sur {0}

source: &Push
fr: &Publier

source: Force &push
fr: Forcer à &publier

source: Force push: Destructive action!
fr: Forcer à publier : Action destructrice !

source: &Push new branch
fr: &Publier nouvelle branche

source: This name is already taken by another branch on this remote.
fr: Ce nom est déjà pris par une autre branche sur ce serveur.

source: Reset to default name
fr: Remettre le nom par défaut

source: Absorb submodule
fr: Absorber le sous-module

source: Register submodule
fr: Inscrire le sous-module

# NameValidationError
source: Cannot be empty.
fr: Ne peut être vide.

# NameValidationError
source: This name is already taken by another submodule.
fr: Ce nom désigne déjà un autre sous-module.

# NameValidationError
source: This name is already taken by another remote.
fr: Ce nom désigne déjà un autre serveur.

source: Edit remote {0}
fr: Modifier le serveur {0}

source: Edit remote
fr: Modifier le serveur

source: Save
fr: Enregistrer

source: Add remote
fr: Ajouter un serveur

source: Add
fr: Ajouter

source: Remote operation
fr: Opération sur serveur distant

source: Connecting…
fr: Connexion…

source: Aborting
fr: Abandon en cours

# RepoSettingsDialog
source: from global config
fr: provient de la config globale

# RepoSettingsDialog
source: global git identity not configured
fr: aucune identité globale configurée pour git

source: Hard reset: Destructive action!
fr: Réinitialisation “hard” : Action destructrice !

source: Reset {0} to {1}
fr: Réinitialiser {0} sur {1}

# SearchBar
source: {0} not found.
fr: {0} introuvable.

source: Stash && Keep Changes
fr: Remiser et conserver modifs

source: Stash && Reset Changes
fr: Remiser puis effacer modifs

source: &Include these files in the stash, then reset them to their unmodified state:
fr: &Inclure ces fichiers dans la remise, puis les rétablir à leur état non-modifié :

source: &Include these files in the stash:
fr: &Inclure ces fichiers dans la remise :

# AboutDialog
source: About {0}
fr: À propos de {0}

# AboutDialog
source: About
fr: À propos

# AboutDialog
source: Components
fr: Composants

# AboutDialog
source: Acknowledgments
fr: Remerciements

# AboutDialog
source: License
fr: Licence

# CheckoutCommitDialog
source: Check out commit
fr: Basculer dans le commit

# CheckoutCommitDialog
source: How do you want to check out this commit?
fr: Comment voulez-vous basculer dans ce commit ?

# CheckoutCommitDialog
source: Switch to &branch:
fr: Basculer dans la &branche :

# CheckoutCommitDialog
source: List of branches that point to this commit.
fr: Liste des branches qui pointent sur ce commit.

# CheckoutCommitDialog
source: Enter &detached HEAD here
fr: &Passer en HEAD détachée ici

# CheckoutCommitDialog
source: Start &new branch here…
fr: Démarrer une &nouvelle branche ici…

# CheckoutCommitDialog
source: After the checkout:
fr: Après avoir basculé dans le commit :

# CheckoutCommitDialog
source: Update submodules recursively
fr: Mettre à jour les sous-modules récursivement

# CloneDialog
source: Clone repository
fr: Cloner un dépôt

# CloneDialog
source: Remote &URL:
fr: &URL du serveur :

# CloneDialog
source: Clone in&to:
fr: Cloner &dans :

# CloneDialog
source: &Browse…
fr: &Parcourir…

# CloneDialog
source: Initialize submodules recursively (if any)
fr: Initialiser les sous-modules récursivement (s’il y en a)

# CloneDialog
source: <p>Tick this to download just the latest commits, not the entire history of the repository.
fr: <p>Cochez ceci pour ne télécharger que les derniers commits, et non l’intégralité de l’historique du dépôt.

# CloneDialog
source: Log in with custom &key file
fr: Se connecter avec une clé s&péciale

# CloneDialog
source: Status
fr: État

# CommitDialog
source: Commit
fr: Committer

# CommitDialog
source: Enter commit summary
fr: Saisir le résumé du commit

# CommitDialog
source: <p>Length of the summary. Convention is to stay under 50 characters and avoid going over 72. If that’s not enough, use the long-form description.</p>
fr: <p>Longueur du résumé. En règle générale, essayez de rester en-deçà de 50 caractères, et évitez de dépasser 72. Si c’est insuffisant, utilisez la description détaillée.</p>

# CommitDialog
source: Long-form description (optional)
fr: Description détaillée (facultatif)

# CommitDialog
source: Customi&ze Signature
fr: Modifier &signature

# CommitDialog
source: Preview
fr: Aperçu

# ConflictView
source: Merge conflict
fr: Conflit de fusion

# ConflictView
source: Merge conflict on {0}
fr: Conflit de fusion sur {0}

# ConflictView
source: OUR version
fr: NOTRE version

# ConflictView
source: or
fr: ou

# ConflictView
source: THEIR version
fr: LEUR version

# ConflictView
source: Select another external merge tool in the Settings.
fr: Choisir un autre outil de fusion dans les Réglages.

# ConflictView
source: Change merge tool…
fr: Changer d’outil de fusion…

# ConflictView
source: <p>Open {tool} so you can merge both versions by hand. When you are done, save the file and quit {tool} to resolve the conflict.
fr: <p>Ouvrir {tool} afin de fusionner les deux versions à la main. Une fois que vous aurez terminé, sauvegardez le fichier puis quittez {tool} pour résoudre le conflit.

# ConflictView
source: Merge both versions in {tool}
fr: Fusionner les deux versions dans {tool}

# ConflictView
source: Abort
fr: Abandonner

# ConflictView
source: <p>Ignore the merge that you made in {tool} so that you can start over.
fr: <p>Ignorer la fusion que vous avez achevée dans {tool} afin de reprendre à zéro.

# ConflictView
source: Discard this merge
fr: Jeter cette fusion

# ConflictView
source: It looks like you’ve finished merging this file.
fr: Vous semblez avoir terminé la fusion de ce fichier.

# ConflictView
source: <p>Merge this file in {tool} again, starting where you left off.
fr: <p>Fusionner à nouveau ce fichier dans {tool}, en repartant d’où vous vous étiez arrêté.

# ConflictView
source: Merge again
fr: Fusionner à nouveau

# ConflictView
source: <p>Resolve this conflict by accepting the merge that you’ve completed in {tool}.
fr: <p>Résoudre ce conflit en acceptant la fusion que vous avez achevée dans {tool}.

# ConflictView
source: Resolve the conflict with your merge
fr: Résoudre le conflit avec votre fusion

# ConflictView
source: Confirm deletion
fr: Confirmer la suppression

# DeleteTagDialog
source: Delete tag
fr: Supprimer l’étiquette

# DeleteTagDialog
source: Really delete tag {0}?
fr: Êtes-vous sûr de supprimer l’étiquette {0} ?

# DeleteTagDialog
source: &Push deletion to:
fr: &Publier la suppression vers :

# DonatePrompt
source: Hi! I hope you’re enjoying {app}. If {app} helps you get work done, please consider making a small donation! This will encourage me to keep developing it. Thank you! -Iliyas
fr: Bonjour ! J’espère que vous appréciez {app}. Si {app} vous facilite la vie, veuillez envisager de faire un petit don ! Cela m’encouragera à poursuivre le développement. Merci ! -Iliyas

# DonatePrompt
source: Donate {amount}
fr: Faire un don de {amount}

# DonatePrompt
source: Never show this again
fr: Ne plus jamais afficher ceci

# DonatePrompt
source: Remind me in {month}
fr: Me rappeler en {month}

# DonatePrompt
source: THANK YOU!
fr: MERCI !

# IdentityDialog
source: Set up your Git identity
fr: Renseignez votre identité Git

# IdentityDialog
source: &Name:
fr: &Nom :

# IdentityDialog
source: &Email:
fr: &Courriel :

# IdentityDialog
source: Note: This will not apply to the current repository, because its configuration file defines a custom identity.
fr: Note : Cela ne s’appliquera pas au dépôt actuel, car son fichier de configuration définit une identité spécifique.

# IdentityDialog
source: This information will be saved in {0}.
fr: Ces informations seront sauvegardées dans {0}.

# NewBranchDialog
source: New branch
fr: Nouvelle branche

# NewBranchDialog
source: &Name:
fr: &Nom :

# NewBranchDialog
source: &Switch to branch after creating
fr: &Basculer dans cette branche après l’avoir créée

# NewBranchDialog
source: &Track upstream branch:
fr: &Suivre branche amont :

# NewBranchDialog
source: …then update submodules recursively
fr: …puis, mettre à jour les sous-modules récursivement

# NewTagDialog
source: New tag
fr: Nouvelle étiquette

# NewTagDialog
source: &Name:
fr: &Nom :

# NewTagDialog
source: Enter tag name
fr: Saisissez le nom de l’étiquette

# NewTagDialog
source: &Push to:
fr: Publier &vers :

# OpenRepoProgress
source: Opening repository…
fr: Ouverture du dépôt…

# OpenRepoProgress
source: Abort
fr: Abandonner

# PushDialog
source: Push branch
fr: Publier la branche (push)

# PushDialog
source: &Local branch:
fr: Branche &locale :

# PushDialog
source: Push &to:
fr: Publier &vers :

# PushDialog
source: Branch name on remote
fr: Nom de la branche sur serveur

# PushDialog
source: &Force push
fr: &Forcer à publier

# PushDialog
source: &Track this remote branch after pushing
fr: &Suivre cette branche distante une fois publiée

# PushDialog
source: Status
fr: État

# RegisterSubmoduleDialog
source: Register submodule
fr: Inscrire le sous-module

# RegisterSubmoduleDialog
source: Workdir:
fr: Rép. de travail :

# RegisterSubmoduleDialog
source: &Name:
fr: &Nom :

# RegisterSubmoduleDialog
source: &Remote:
fr: &Serveur :

# RegisterSubmoduleDialog
source: <p>This will be the default remote for this submodule. People who clone your repo will use this remote to download the submodule.
fr: <p>Ceci sera le serveur par défaut pour ce sous-module. Les personnes qui cloneront votre dépôt utiliseront ce serveur pour télécharger le sous-module.

# RegisterSubmoduleDialog
source: Once absorbed as a submodule, this copy of {sub} cannot be used independently from its superproject, {super}. This cannot be undone!
fr: Une fois absorbée comme sous-module, cette copie de {sub} ne pourra plus être utilisée indépendamment de son super-projet, {super}. Vous ne pourrez pas annuler ceci !

# RegisterSubmoduleDialog
source: <p>This name uniquely identifies your submodule in “.gitmodules”. It can be anything you like, but common practice is to simply name it after the submodule’s workdir.
fr: <p>Ce nom identifiera votre sous-module de façon unique dans “.gitmodules”. Le choix du nom est totalement libre, mais la coutume veut qu’un sous-module ait le même nom que son répertoire de travail.

# RemoteDialog
source: Edit remote
fr: Modifier le serveur

# RemoteDialog
source: &Name:
fr: &Nom :

# RemoteDialog
source: Log in with custom &key file
fr: Se connecter avec une clé s&péciale

# RemoteDialog
source: &Fetch remote branches after adding
fr: &Récupérer les branches distantes après ajout du serveur

# RemoteLinkDialog
source: Remote operation
fr: Opération sur serveur distant

# RepoSettingsDialog
source: Repo Settings for {repo}
fr: Paramètres du dépôt {repo}

# RepoSettingsDialog
source: Repo Nic&kname:
fr: &Surnom du dépôt :

# RepoSettingsDialog
source: This nickname will appear within {app} in tab names, menus, etc. It does not change the actual name of the repo’s directory. Leave blank to clear the nickname.
fr: Ce surnom apparaîtra au sein de {app} dans les onglets, menus, etc. Cela ne changera pas le nom réel du dossier du dépôt. Laissez la case vide pour effacer le surnom.

# RepoSettingsDialog
source: No nickname
fr: Pas de surnom

# RepoSettingsDialog
source: Create commits under a custom &identity in this repo
fr: Créer des commits sous une &identité propre à ce dépôt

# RepoSettingsDialog
source: &Name:
fr: &Nom :

# RepoSettingsDialog
source: &Email:
fr: &Courriel :

# ResetHeadDialog
source: Reset HEAD
fr: Déplacer HEAD

# ResetHeadDialog
source: <b>Keep</b> all your files intact. <br><b>Stage</b> any differences between your files and {commit}.
fr: <b>Garder intacts</b> tous vos fichiers. <br><b>Indexer</b> les divergences entre vos fichiers et {commit}.

# ResetHeadDialog
source: <b>Keep</b> all your files intact. <br><b>Unstage</b> any differences between your files and {commit}.
fr: <b>Garder intacts</b> tous vos fichiers. <br><b>Désindexer</b> les divergences entre vos fichiers et {commit}.

# ResetHeadDialog
source: <b>Wipe</b> all your changes. <br>End result identical to a fresh checkout of {commit}.
fr: <b>Éliminer</b> toutes vous modifications. <br>Le résultat final sera identique à un checkout propre de {commit}.

# ResetHeadDialog
source: &Reset submodules recursively
fr: &Réinitialiser les sous-modules récursivement

# SearchBar
source: Search
fr: Recherche

# SearchBar
source: Search…
fr: Rechercher…

# SearchBar
source: Next Occurrence
fr: Occurrence suivante

# SearchBar
source: Previous Occurrence
fr: Occurrence précédente

# SearchBar
source: Close Search Bar
fr: Fermer la barre de recherche

# SearchBar
source: Done
fr: Terminé

# SignatureForm
source: &Override:
fr: Rem&placer :

# SignatureForm
source: &Identity:
fr: &Identité :

# SignatureForm
source: Name
fr: Nom

# SignatureForm
source: Email
fr: Courriel

# SignatureForm
source: &Time:
fr: &Date et heure :

# SignatureForm
source: Offset from UTC
fr: Décalage horaire par rapport à UTC

# SignatureForm
source: Set to current local time
fr: Mettre à l’heure locale actuelle

# SignatureForm
source: Now
fr: Maintenant

# SignatureForm
source: <p>Two signatures are recorded in every commit – one for the author, and one for the committer. Select which signature you want to customize.
fr: <p>Deux signatures sont enregistrées dans chaque commit – l’une pour l’auteur, l’autre pour le committeur. Choisissez quelle signature vous souhaitez remplacer.

# SignatureForm
source: Author’s Signature
fr: Signature de l’auteur

# SignatureForm
source: Committer’s Signature
fr: Signature du committeur

# SignatureForm
source: Both Signatures
fr: Les deux signatures

# StashDialog
source: New stash
fr: Nouvelle remise (stash)

# StashDialog
source: Optional stash message
fr: Message facultatif pour cette remise

# StashDialog
source: Normally, stashed changes are removed from the working directory. Tick this to leave the stashed changes intact instead.
fr: Habituellement, une fois la remise créée, les fichiers sélectionnés sont rétablis à leur état non-modifié. Cochez cette case pour que les modifications remisées restent intactes dans le répertoire de travail.

# StashDialog
source: &Retain stashed changes in working directory
fr: &Conserver les modifs dans le répertoire de travail après remise

# StashDialog
source: Warning: Some of the files have both staged and unstaged changes. Those changes will be combined in the stash.
fr: Attention : certains fichiers comprennent des modifications indexées et non-indexées. Ces modifications seront combinées dans la remise.

# UnloadedRepoPlaceholder
source: Unloaded repository
fr: Dépôt déchargé

# UnloadedRepoPlaceholder
source: Ready to load this repository.
fr: Prêt à charger ce dépôt.

# UnloadedRepoPlaceholder
source: Load
fr: Charger

# WelcomeWidget
source: Welcome
fr: Bienvenue

# WelcomeWidget
source: Clone remote repository
fr: Cloner un dépôt distant

# WelcomeWidget
source: New empty repository
fr: Nouveau dépôt vierge

# WelcomeWidget
source: Open local repository
fr: Ouvrir un dépôt local

# WelcomeWidget
source: Recent repositories
fr: Dépôts récents

# WelcomeWidget
source: Welcome to<br>{app}
fr: Bienvenue dans<br>{app}

source: Commit draft:
fr: Brouillon de commit :

source: History truncated to {0} commits (including hidden branches)
fr: Historique tronqué à {0} commits (y compris les branches cachées)

source: History truncated to {0} commits
fr: Historique tronqué à {0} commits

source: Shallow clone – End of commit history
fr: Clone superficiel – Fin de l’historique des commits

source: Detached HEAD
fr: HEAD détachée

# CommitTooltip
source: (authored)
fr: (créé)

# CommitTooltip
source: (committed)
fr: (committé)

# CommitTooltip
source: Committed by {0}
fr: Committé par {0}

source: This commit isn’t shown in the graph because it’s part of a hidden branch.
fr: Ce commit ne figure pas dans le graphe car il fait partie d’une branche masquée.

source: This commit isn’t shown in the graph because it isn’t part of the truncated commit history.
fr: Ce commit ne figure pas dans le graphe car il est en-dehors de l’historique tronqué.

source: This commit isn’t shown in the graph.
fr: Ce commit ne figure pas dans le graphe.

source: Find a commit by hash, message or author|Find commit
fr: Rechercher un commit par son hachage, message ou auteur|Rechercher un commit|Rech. un commit|Rech. commit

source: Load up to {0} commits
fr: Charger jusqu’à {0} commits

source: Load full commit history
fr: Charger l’historique de commits en entier

source: Change threshold setting
fr: Paramétrer le seuil

source: &Merge into {0}…
fr: &Fusionner dans {0}…

source: &Check Out…
fr: Basculer dans ce &commit…

source: New &Branch Here…
fr: Nouvelle &branche ici…

source: &Tag This Commit…
fr: É&tiqueter ce commit…

source: &Reset HEAD to Here…
fr: Déplacer &HEAD ici…

source: Cherry &Pick…
fr: &Picorer…

source: Re&vert…
fr: Inverser…

source: E&xport As Patch…
fr: E&xporter correctif…

source: Copy Commit &Hash
fr: Copier le &hachage du commit

source: Get &Info…
fr: &Infos sur le commit…

source: &File
fr: &Fichier

source: &Edit
fr: &Édition

source: &View
fr: &Affichage

source: &Repo
fr: &Dépôt

source: &Help
fr: Aid&e

source: &New Repository…
fr: &Nouveau dépôt…

source: Create an empty Git repo
fr: Créer un dépôt Git vierge

source: C&lone Repository…
fr: C&loner un dépôt…

source: Download a Git repo and open it
fr: Télécharger un dépôt Git et l’ouvrir

source: &Open Repository…
fr: &Ouvrir un dépôt…

source: Open &Recent
fr: Ouvrir un dépôt &récent

source: List of recently opened Git repos
fr: Liste des dépôts Git ouverts récemment

source: &Settings…
fr: Réglages…

source: &Close Tab
fr: &Fermer l’onglet

source: Close current repository tab
fr: Fermer l’onglet courant

source: &Quit
fr: &Quitter

source: Quit {app}
fr: Quitter {app}

source: &Find…
fr: &Rechercher…

source: Search for a piece of text in commit messages, the current diff, or the name of a file
fr: Rechercher du texte dans les messages des commits, la diff ouverte, ou le nom d’un fichier

source: Find Next
fr: Rechercher suivant

source: Find next occurrence
fr: Rechercher l’occurrence suivante

source: Find Previous
fr: Rechercher précédent

source: Find previous occurrence
fr: Rechercher l’occurrence précédente

source: Show status bar
fr: Afficher la barre d’état

source: Show menu bar
fr: Afficher la barre de menus

source: Focus on Sidebar
fr: Focus sur la barre latérale

source: Focus on Commit Log
fr: Focus sur l’historique de commits

source: Focus on File List
fr: Focus sur la liste de fichiers

source: Focus on Code View
fr: Focus sur l’affichage du code

source: Next File
fr: Fichier suivant

source: Previous File
fr: Fichier précédent

source: &Next Tab
fr: Onglet &suivant

source: &Previous Tab
fr: Onglet &précédent

source: Navigation Log
fr: Journal de navigation

source: &Refresh
fr: &Rafraîchir

source: Check for changes in the repo (on the local filesystem only – will not fetch remotes)
fr: Rechercher les modifications dans le dépôt (sur le système de fichiers local uniquement – les serveurs distants ne seront pas consultés)

source: Reloa&d
fr: Recharger

source: Reopen the repo from scratch
fr: Rouvrir complètement le dépôt

source: &About {0}
fr: À propos &de {0}

source: {0} User’s Guide
fr: Guide de l’utilisateur de {0}

source: Open Trash…
fr: Ouvrir la poubelle à modifs…

source: Explore changes that you may have discarded by mistake
fr: Examiner les modifications que vous avez peut-être rejetées par erreur

source: Empty Trash…
fr: Vider la poubelle…

source: Delete all discarded changes from the trash folder
fr: Supprimer définitivement toutes les modifications jetées à la poubelle

source: Clear List
fr: Effacer la liste

source: Clear the list of recently opened repositories
fr: Effacer la liste des dépôts ouverts récemment

source: Menu bar hidden
fr: Barre de menus cachée

source: The menu bar is now hidden. Press the Alt key to toggle it.
fr: La barre de menus est maintenant cachée. Appuyez sur la touche Alt pour la faire apparaître.

source: Close Tab
fr: Fermer l’onglet

source: Close Other Tabs
fr: Fermer les autres onglets

source: Unload Other Tabs
fr: Décharger les autres onglets

source: Configure Tabs…
fr: Configurer les onglets…

source: Open repository
fr: Ouvrir un dépôt

source: Couldn’t open the repository at {0}.
fr: Impossible d’ouvrir le dépôt situé dans {0}.

source: There’s nothing at this path.
fr: Il n’y a rien à ce chemin.

source: Sorry, {app} doesn’t support bare repositories.
fr: Désolé, {app} ne gère pas les dépôts nus (“bare repository”).

source: Open trash folder
fr: Ouvrir la poubelle à modifs

source: There’s no trash folder. Perhaps you haven’t discarded a change with {0} yet.
fr: Il n’y a pas de poubelle à modifs. Peut-être n’avez-vous pas encore jeté de modif à l’aide de {0}.

source: Clear trash folder
fr: Vider la poubelle à modifs

source: There are no discarded changes to delete.
fr: Il n’y a aucune modification jetée à la poubelle.

source: Do you want to permanently delete <b>{n}</b> discarded patch?
fr: Voulez-vous effacer définitivement <b>{n}</b> modification jetée à la poubelle ?

source: This will free up {0} on disk.
fr: Cela libèrera {0} sur le disque.

source: This cannot be undone!
fr: Cette action est irréversible !

source: Delete permanently
fr: Supprimer définitivement

source: New repository
fr: Nouveau dépôt

source: &Create repo here
fr: &Créer dépôt ici
