Repository: jorio/gitfourchette
Catalog: gitfourchette/assets/lang/*.po
Languages: fr

source: Are you sure you want to initialize a Git repository in {0}? This directory isn’t empty.
fr: Êtes-vous sûr d’initialiser un dépôt Git dans {0} ? Ce répertoire n’est pas vide.

source: Directory isn’t empty
fr: Répertoire non-vide

source: Couldn’t create an empty repository in {0}.
fr: Impossible de créer un dépôt dans {0}.

source: A repository already exists here:
fr: Un dépôt existe déjà ici :

source: Repository already exists
fr: Dépôt déjà existant

source: &Open existing repo
fr: &Ouvrir dépôt existant

source: An existing repository, {0}, was found in a parent folder of this location:
fr: Il existe déjà un dépôt {0} dans un dossier parent du dépôt que vous alliez créer :

source: Are you sure you want to create {1} within the existing repo?
fr: Voulez-vous tout de même créer {1} au sein du dépôt existant ?

source: Repository found in parent folder
fr: Dépôt détecté dans un répertoire parent

source: &Open {0}
fr: &Ouvrir {0}

source: &Create {0}
fr: &Créer {0}

source: {n} background tab unloaded.
fr: {n} onglet déchargé en arrière-plan.

source: The session couldn’t be restored fully because a repository failed to load:
fr: La session n’a pas pu être restaurée complètement car un dépôt n’a pu être chargé :

source: Restore session
fr: Restaurer la session

source: Apply Settings
fr: Application des préférences

source: You may need to restart {app} for the new settings to take effect fully.
fr: Il vous faudra peut-être redémarrer {app} pour que les nouveaux réglages prennent tous effet.

source: The new settings won’t take effect fully until you reload the current repositories.
fr: Les nouveaux réglages prendront effet après avoir rechargé les dépôts ouverts.

source: &Reload
fr: &Recharger

source: &Not Now
fr: &Plus tard

source: {0} failed to start.
fr: Impossible de lancer {0}.

source: {0} ran into error {1}.
fr: {0} a rencontré l’erreur {1}.

source: {0} didn’t complete the merge.
fr: {0} n’a pas achevé la fusion.

source: Exit code: {0}.
fr: Code de sortie : {0}.

# NavContext
source: Empty
fr: Vide

# NavContext
source: Untracked
fr: Non-suivi

# NavContext
source: Unstaged
fr: Non-indexé

# NavContext
source: Staged
fr: Indexé

# NavContext
source: Committed
fr: Committé

# NavContext
source: Unknown
fr: Inconnu

source: Remote operation interrupted by user.
fr: Opération à distance interrompue par l’utilisateur.

source: Remote-specific public key file not found:
fr: Le fichier de clé publique spécifique au serveur est introuvable :

source: Remote-specific private key file not found:
fr: Le fichier de clé privée spécifique au serveur est introuvable :

source: Aborting remote operation…
fr: Interruption de l’opération à distance…

source: Too many credential retries.
fr: Trop de tentatives d’authentification rejetées.

source: Logging in with key:
fr: Connexion avec la clé :

source: Unsupported authentication type.
fr: Type d’authentification non géré.

source: The remote claims to accept: {0}.
fr: Le serveur dit accepter : {0}.

source: Could not find suitable key files for this remote.
fr: Impossible de trouver une clé adaptée à ce serveur.

source: The key files couldn’t be opened (permission issues?).
fr: Les fichiers de clés ne peuvent pas être ouverts (problème de permissions ?).

source: The remote has rejected your custom key file ({0}).
fr: Le serveur a rejeté votre clé spéciale ({0}).

source: To change key file settings for this remote, right-click on the remote in the sidebar and pick “Edit Remote”.
fr: Pour paramétrer les clés à utiliser sur ce serveur, faites un clic droit sur le serveur dans la barre latérale et choisissez “Modifier le serveur”.

source: Credentials rejected by remote.
fr: Identité rejetée par le serveur.

source: Downloading: {0}…
fr: Téléchargement : {0}…

source: Download complete ({0}).
fr: Téléchargement terminé ({0}).

source: Indexing {0} of {1} objects…
fr: Indexation de {0} objets sur {1}…

source: Push update reference:
fr: Publication de la mise à jour de la référence :

source: Passphrase-protected key file
fr: Clé protégée par mot de passe

source: Enter passphrase to use this key file:
fr: Saisissez le mot de passe pour utiliser cette clé :

source: {0} is already up-to-date with {1}.
fr: {0} est déjà à jour avec {1}.

source: {0} created: {1}.
fr: {0} créée : {1}.

source: {0} deleted, was {1}.
fr: {0} supprimée, pointait sur {1}.

source: No new commits.
fr: Aucun nouveau commit.

source: Try to reload
fr: Essayer de recharger

source: Only text diffs may be opened in a separate window.
fr: Seules les diffs textuelles peuvent être ouvertes dans une fenêtre détachée.

source: Open Superproject
fr: Ouvrir le super-projet

source: This repository does not have a superproject.
fr: Ce dépôt n’a pas de super-projet.

source: File {0} does not exist.
fr: Le fichier {0} n’existe pas.

source: Do you want to create it?
fr: Voulez-vous le créer ?

source: Create {0}
fr: Créer {0}

source: {0} not found among the branches that aren’t hidden.
fr: {0} introuvable parmi les branches qui ne sont pas cachées.

source: {0} not found.
fr: {0} introuvable.

source: Note: The search was limited to the top commit because the commit history is truncated.
fr: Note : La recherche est bornée au commit le plus récent car l’historique des commits est tronqué.

source: Note: The search was limited to the single commit available in this shallow clone.
fr: Note : La recherche est bornée à l’unique commit disponible dans ce clone superficiel (“shallow clone”).

source: Unborn HEAD
fr: HEAD non-née

source: Merging {0}
fr: Fusion de {0} en cours

source: All conflicts fixed. Commit to conclude.
fr: Conflits résolus. Committez pour conclure.

source: Conflicts need fixing.
fr: Des conflits doivent être résolus.

source: Abort merge
fr: Abandonner la fusion

source: Commit to conclude the cherry-pick.
fr: Validez le commit pour conclure le picorage.

source: Abort cherry-pick
fr: Abandonner le picorage

source: Commit to conclude the revert.
fr: Validez le commit pour conclure l’inversion.

source: Abort revert
fr: Abandonner l’inversion

source: Conflicts
fr: Conflits

source: Fix the conflicts among the uncommitted changes.
fr: Résolvez les conflits parmi les modifications non-committées.

source: Reset index
fr: Réinitialiser l’index

source: Warning
fr: Avertissement

source: The repo is currently in state {state}, which {app} doesn’t support yet. Use <code>git</code> on the command line to continue.
fr: Le dépôt est actuellement dans l’état {state}, que {app} ne sait pas encore gérer. Utilisez <code>git</code> à la ligne de commande pour continuer.

source: Repository folder went missing:
fr: Le dossier du dépôt a disparu :

source: &Local Config Files
fr: Fichiers de config &locaux

source: Open Superproject {0}
fr: Ouvrir le super-projet {0}

source: &Open Repo Folder
fr: &Ouvrir le dossier du dépôt

source: Open this repo’s working directory in the system’s file manager
fr: Ouvrir le répertoire de travail de ce dépôt dans le gestionnaire de fichiers de votre système

source: Cop&y Repo Path
fr: Cop&ier le chemin du dépôt

source: Copy the absolute path to this repo’s working directory to the clipboard
fr: Copier le chemin absolu du répertoire de travail de ce dépôt dans le presse-papiers

source: External editor
fr: Éditeur externe

source: Diff tool
fr: Outil de diff

source: Merge tool
fr: Outil de fusion

# sort branches by date of latest commit, descending
source: Branch Tips (Newest First)
fr: Extrémités des branches (la plus récente en premier)

# sort branches by date of latest commit, ascending
source: Branch Tips (Oldest First)
fr: Extrémités des branches (la plus ancienne en premier)

# sort branches by name (alphabetically), ascending
source: Name (A-Z)
fr: Nom (A à Z)

# sort branches by name (alphabetically), descending
source: Name (Z-A)
fr: Nom (Z à A)

# sort tags by date, descending
source: Date (Newest First)
fr: Date (la plus récente d’abord)

# sort tags by date, ascending
source: Date (Oldest First)
fr: Date (la plus ancienne d’abord)

source: &New Branch…
fr: &Nouvelle branche…

source: Sort By
fr: Trier par

source: &Switch to {0}
fr: Ba&sculer dans {0}

source: &Fetch {0}…
fr: Réc&upérer (fetch) {0}…

source: Fetch…
fr: Récupérer…

source: Pu&ll from {0}…
fr: &Tirer (pull) depuis {0}…

source: Pull…
fr: Tirer…

source: Fast-Forward to {0}…
fr: Avance-rapide vers {0}…

source: Fast-Forward…
fr: Avance-rapide…

source: &Push to {0}…
fr: &Publier vers {0}…

source: Push…
fr: Publier…

source: &Upstream Branch
fr: Branche &amont

source: Re&name…
fr: Renommer…

source: &Delete…
fr: Supprimer…

source: &Hide in Graph
fr: Cac&her dans le graphe

source: Hide this branch from the graph (effective if no other branches/tags point here)
fr: Cacher cette branche du graphe (n’est effectif que si aucune autre branche/étiquette ne pointe ici)

source: Visit Web Page on {0}…
fr: Visiter la page web sur {0}…

source: New Local &Branch Here…
fr: Nouvelle &branche locale ici…

source: &Fetch New Commits…
fr: Réc&upérer (fetch) les nouveaux commits…

source: Rename branch on remote…
fr: Renommer la branche sur le serveur…

source: Delete branch on remote…
fr: Supprimer la branche sur le serveur…

source: Collapse All Folders
fr: Réduire tous les dossiers

source: Expand All Folders
fr: Développer tous les dossiers

source: &Edit Remote…
fr: &Modifier le serveur…

source: &Fetch Remote Branches…
fr: Réc&upérer les branches distantes (fetch)…

source: &Remove Remote…
fr: &Oublier le serveur…

source: Copy Remote &URL
fr: Copier l’&URL du dépôt distant

source: &Hide Remote in Graph
fr: &Masquer le serveur dans le graphe

source: Sort Remote Branches By
fr: Trier les branches distantes par

source: Re&name Folder…
fr: Re&nommer le dossier…

source: &Delete Folder…
fr: &Supprimer le dossier…

source: &Hide Folder Contents in Graph
fr: Cac&her le contenu du dossier dans le graphe

# apply stash
source: &Apply
fr: &Appliquer

source: &Delete
fr: &Supprimer

source: Reveal &Parent Commit
fr: Révéler le commit &parent

source: &New Tag on HEAD Commit…
fr: &Nouvelle étiquette sur le commit en HEAD…

source: &Push All Tags To
fr: &Publier toutes les étiquettes vers

source: &Check Out Tagged Commit…
fr: &Basculer dans le commit étiqueté…

source: &Delete Tag
fr: &Supprimer l’étiquette

source: Push To
fr: Publier vers

source: &Open Submodule in New Tab
fr: &Ouvrir le sous-module dans un nouvel onglet

source: Open Submodule &Folder
fr: Ouvrir le &dossier du sous-module

source: Copy &Path
fr: Co&pier le chemin

source: Not tracking any upstream branch
fr: Aucune branche amont suivie

source: Stop tracking upstream branch
fr: Ne plus suivre de branche amont

source: No remotes.
fr: Aucun serveur.

source: No remote branches found. Try fetching the remotes.
fr: Aucune branche distante. Essayez de récupérer (fetch) les serveurs.

source: &All Remotes
fr: &Tous les serveurs

source: Submodule not initialized.
fr: Sous-module non-initialisé.

source: {0} (local branch)
fr: {0} (branche locale)

source: Upstream: {0}
fr: Amont : {0}

source: (this is the checked-out branch)
fr: (ceci est la branche courante)

source: [unborn]
fr: [non-née]

source: Unborn HEAD: does not point to a commit yet.
fr: HEAD non-née : ne pointe sur aucun commit pour l’instant.

source: Local branch {0} will be created when you create the initial commit.
fr: La branche locale {0} sera créée lorsque vous aurez validé le commit initial.

source: {0} (remote-tracking branch)
fr: {0} (branche de suivi)

source: Upstream for the checked-out branch ({0})
fr: Branche amont de la branche locale courante ({0})

source: {0} (remote branch folder)
fr: {0} (dossier de branches distantes)

source: {0} (tag folder)
fr: {0} (dossier d’étiquettes)

source: {0} (local branch folder)
fr: {0} (dossier de branches locales)

source: Tag {0}
fr: Étiquette {0}

source: {0} (submodule)
fr: {0} (sous-module)

source: Workdir: {0}
fr: Rép. de travail : {0}

source: [not set]
fr: [non spécifié]

source: Go to Uncommitted Changes
fr: Aller aux Modifications non-committées

source: Branch {0} is already checked out.
fr: {0} est déjà la branche courante.

source: Do you want to switch to branch {0}?
fr: Voulez-vous basculer dans la branche {0} ?

source: Switch
fr: Basculer

source: Update submodules recursively
fr: Mettre à jour les sous-modules récursivement

source: You are in <b>Detached HEAD</b> mode at commit {0}.
fr: Vous êtes en mode <b>HEAD détachée</b> au commit {0}.

source: You might lose track of this commit if you carry on switching to {1}.
fr: Vous pourriez perdre trace de ce commit si vous basculez dans {1}.

source: Switched to branch {0}.
fr: Basculé dans la branche {0}.

source: Rename local branch
fr: Renommer la branche locale

source: Enter new name:
fr: Saisissez un nouveau nom :

source: Current name: {0}
fr: Nom actuel : {0}

source: Rename
fr: Renommer

source: Branch {0} renamed to {1}.
fr: Branche {0} renommée {1}.

source: This name clashes with existing branch {0}.
fr: Ce nom est en conflit avec la branche existante {0}.

source: Folder {name} contains {n} branch.
fr: Le dossier {name} contient {n} branche.

source: Rename branch folder
fr: Renommer le dossier de branches

source: Leave blank to move the branches to the root folder.
fr: Laissez vide pour remonter les branches dans le dossier racine.

source: Branch folder {0} renamed to {1}.
fr: Dossier de branches {0} renommé {1}.

source: {n} branch affected.
fr: {n} branche concernée.

source: Cannot delete {0} because it is the current branch.
fr: Impossible de supprimer {0} car c’est la branche courante.

source: Before you try again, switch to another branch.
fr: Avant de réessayer, changez de branche.

source: Really delete local branch {0}?
fr: Êtes-vous sûr de supprimer la branche locale {0} ?

source: Delete branch
fr: Supprimer la branche

source: Branch {0} deleted (commit at tip was {1}).
fr: Branche {0} supprimée (elle pointait sur le commit {1}).

source: Cannot delete folder {0} because it contains the current branch {1}.
fr: Impossible de supprimer le dossier {0} car il contient la branche courante {1}.

source: Really delete local branch folder {0}?
fr: Êtes-vous sûr de supprimer le dossier de branches locales {0} ?

source: <b>{n}</b> branch will be deleted.
fr: <b>{n}</b> branche sera supprimée.

source: Delete branch folder
fr: Supprimer le dossier de branches

source: Delete folder
fr: Supprimer le dossier

source: {n} branch deleted in folder {name}.
fr: {n} branche supprimée dans le dossier {name}.

source: Branch {0} created on commit {1}.
fr: Branche {0} créée sur le commit {1}.

source: You might lose track of this commit if you switch to the new branch.
fr: Vous pourriez perdre trace de ce commit si vous basculez dans la nouvelle branche.

source: Don’t Switch
fr: Ne pas basculer

source: Switch to {0}
fr: Basculer dans {0}

source: Branch {0} now tracks {1}.
fr: La branche {0} suit désormais {1}.

source: Branch {0} now tracks no upstream.
fr: La branche {0} ne suit désormais pas de branche amont.

source: Can’t fast-forward {0} because it isn’t tracking an upstream branch.
fr: Impossible de faire une avance-rapide sur {0} car cette branche ne suit pas de branche amont.

source: No fast-forwarding necessary.
fr: L’avance-rapide n’est pas nécessaire.

source: Your local branch {0} is ahead of {1}.
fr: Votre branche locale {0} est en avance sur {1}.

source: Your local branch {0} is already up-to-date with {1}.
fr: Votre branche locale {0} est déjà à jour avec {1}.

source: Can’t fast-forward {0} to {1}.
fr: Impossible de faire une avance-rapide de {0} jusqu’à {1}.

source: The branches are divergent.
fr: Les branches sont divergentes.

source: Merge into {0}
fr: Fusionner dans {0}

source: Merging is not possible right now because you have unresolved conflicts.
fr: Impossible de fusionner pour l’instant car vous avez des conflits non-résolus.

source: Fix the conflicts to proceed.
fr: Résolvez les conflits pour continuer.

source: Merging is not possible right now because you have staged changes.
fr: Impossible de fusionner pour l’instant car vous avez des modifications indexées.

source: Commit your changes or stash them to proceed.
fr: Committez vos modifications (ou remisez-les) pour continuer.

source: No merge is necessary.
fr: Aucune fusion n’est nécessaire.

source: Your branch {0} is already up-to-date with {1}.
fr: Votre branche {0} est déjà à jour avec {1}.

source: Cannot merge into an unborn head.
fr: Impossible de merger dans une HEAD non-née (“unborn head”).

source: Fast-forwarding possible
fr: Avance-rapide possible

source: Your branch {0} can simply be fast-forwarded to {1}.
fr: Vous pouvez tout simplement effectuer une avance-rapide de votre branche {0} vers {1}.

source: <b>Fast-forwarding</b> means that the tip of your branch will be moved to a more recent commit in a linear path, without the need to create a merge commit.
fr: L’<b>avance-rapide</b> signifie que l’extrémité de votre branche sera déplacée vers un commit plus récent, suivant un chemin linéaire, sans nécessiter de fusion.

source: In this case, {0} will be fast-forwarded to {1}.
fr: Dans ce cas précis, {0} sera déplacée vers {1}.

source: Fast-Forward
fr: Avance-rapide

source: Merging may cause conflicts
fr: La fusion pourrait entraîner des conflits

source: Merging {0} into {1} may cause conflicts.
fr: La fusion de {0} dans {1} pourrait entraîner des conflits.

source: You will need to fix the conflicts, if any. Then, commit the result to conclude the merge.
fr: Vous devrez résoudre les conflits, s’il y en a. Puis, committez le résultat pour conclure la fusion.

source: Merge
fr: Fusionner

source: Recall lost commit
fr: Récupérer commit perdu

source: If you know the hash of a commit that isn’t part of any branches anymore, {app} will try to recall it for you.
fr: Si vous connaissez le hachage d’un commit qui ne fait plus partie d’aucune branche, {app} tentera de le récupérer pour vous.

source: Recall
fr: Récupérer

source: Create empty commit
fr: Créer un commit vide

source: Empty commit
fr: Commit vide

source: No files are staged for commit.
fr: Aucun fichier n’a été indexé (prêt à être committé).

source: Do you want to create an empty commit anyway?
fr: Voulez-vous tout de même créer un commit vide ?

source: Proceed to Commit
fr: Procéder au commit

source: Commit {0} created.
fr: Commit {0} créé.

source: Proceed to Amend Commit
fr: Procéder à la rectification du commit

source: Commit {0} amended. New hash: {1}.
fr: Commit {0} rectifié. Nouveau hachage : {1}.

source: You might lose track of this commit if you carry on checking out another commit ({1}).
fr: Vous pourriez perdre trace de ce commit si vous basculez dans un autre commit ({1}).

source: Entered detached HEAD on {0}.
fr: Passé en HEAD détachée à {0}.

source: Proceed to New Tag
fr: Procéder à l’étiquetage

source: Tag {0} created on commit {1}.
fr: Étiquette {0} créée sur le commit {1}.

source: Do you want to revert commit {0}?
fr: Voulez-vous inverser le commit {0} ?

source: You will have an opportunity to review the affected files in your working directory.
fr: Vous pourrez passer en revue les fichiers affectés dans votre répertoire de travail.

source: There’s nothing to revert from {0} that the current branch hasn’t already undone.
fr: Il n’y a rien à inverser depuis {0} que la branche actuelle n’ait pas déjà défait.

source: Reverting {0} was successful. Do you want to commit the result now?
fr: L’inversion de {0} a réussi. Voulez-vous committer le résultat maintenant ?

source: Review changes
fr: Examiner les modifs

source: There’s nothing to cherry-pick from {0} that the current branch doesn’t already have.
fr: Il n’y a rien à picorer depuis {0} qui ne fasse pas déjà partie de la branche actuelle.

source: Cherry-picking {0} was successful. Do you want to commit the result now?
fr: Le picorage de {0} a réussi. Voulez-vous committer le résultat maintenant ?

source: {app} cannot export binary patches from a hand-picked selection of files.
fr: {app} ne peut pas exporter des correctifs binaires depuis une sélection manuelle de fichiers.

source: Binary file will be omitted from patch file:
fr: Le fichier binaire sera omis du correctif :

source: Proceed
fr: Continuer

source: Nothing to export. The patch is empty.
fr: Rien à exporter. Le correctif est vide.

source: You have selected an unresolved merge conflict.
fr: Vous avez sélectionné un conflit de fusion non-résolu.

source: There is an unresolved merge conflict among your selection.
fr: Votre sélection comprend un conflit de fusion non-résolu.

# please fix (the merge conflicts)
source: Please fix it before staging:
fr: Veuillez le résoudre avant de l’indexer :

# please fix (the merge conflicts)
source: Please fix it before discarding:
fr: Veuillez le résoudre avant de le jeter :

source: File staged.
fr: Fichier indexé.

source: You’ve added another Git repo inside your current repo. It is STRONGLY RECOMMENDED to absorb it as a submodule before committing.
fr: Vous avez ajouté un autre dépôt Git à l’intérieur du dépôt actuel. Il est FORTEMENT RECOMMANDÉ de l’absorber comme sous-module avant de valider le commit.

source: Don’t forget to remove the submodule from {0} to complete its deletion.
fr: N’oubliez pas de retirer le sous-module de {0} pour achever sa suppression.

source: Uncommitted changes in the submodule can’t be staged from the parent repository.
fr: Les modifications non-committées dans le sous-module ne peuvent pas être indexées depuis le dépôt parent.

source: An item requires your attention after staging:
fr: Un élément requiert votre attention après avoir été indexé :

source: Discard changes
fr: Jeter les modifications

source: Really delete {0}?
fr: Êtes-vous sûr de supprimer {0} ?

source: (This file is untracked – it’s never been committed yet.)
fr: (Ce fichier est non-suivi – il n’a jamais encore été committé.)

source: Really discard changes in submodule {0}?
fr: Êtes-vous sûr de jeter la modification au sous-module {0} ?

source: Really discard changes to {0}?
fr: Êtes-vous sûr de jeter les modifications à {0} ?

source: Really discard changes in {n} submodules?
fr: Êtes-vous sûr de jeter la modification à {n} sous-modules ?

source: Really discard changes to {nf} files and in {ns} submodules?
fr: Êtes-vous sûr de jeter les modifications à {nf} fichiers et dans {ns} sous-modules ?

source: Really discard changes to {n} files?
fr: Êtes-vous sûr de jeter les modifications à {n} fichiers ?

source: Any uncommitted changes in the submodule will be <b>cleared</b> and the submodule’s HEAD will be reset.
fr: Toutes les modifications non-committées dans le sous-module seront <b>effacées</b> et la HEAD du sous-module sera réinitialisée.

source: File discarded.
fr: Fichier jeté.

source: Couldn’t restore gitlink file for submodule {0}.
fr: Impossible de restaurer le fichier gitlink du sous-module {0}.

source: File unstaged.
fr: Fichier désindexé.

source: Really discard mode change in {0}?
fr: Êtes-vous sûr de jeter la modification de mode dans {0} ?

source: Really discard mode changes in <b>{n} files</b>?
fr: Êtes-vous sûr de jeter le changement de mode sur <b>{n} fichiers</b> ?

source: Discard mode changes
fr: Jeter changement de mode

source: Can’t {verb} the selection because no red/green lines are selected.
fr: Impossible de {verb} la sélection car aucune ligne rouge/verte n’est sélectionnée.

source: Really discard this hunk?
fr: Êtes-vous sûr de jeter cette section ?

source: Really discard the selected lines?
fr: Êtes-vous sûr de jeter les lignes sélectionnées ?

source: There’s nothing to revert in the selection.
fr: Il n’y a rien à inverser dans la sélection.

source: Couldn’t revert this patch.
fr: Impossible d’inverser ce correctif.
