Repository: jorio/gitfourchette
Catalog: gitfourchette/assets/lang/*.po
Languages: fr

source: The comfortable Git UI for Linux.
fr: L’interface Git tout confort pour Linux.

source: Turn off multithreading (run all tasks on UI thread).
fr: Désactiver le multithreading (exécuter toutes les tâches sur le thread UI).

source: Enable expensive assertions and development features.
fr: Activer les assertions coûteuses et les fonctions spéciales pour le développement.

source: Prevent loading/saving user settings. (implies --no-threads)
fr: Empêcher le chargement et la sauvegarde des réglages utilisateur. (implique --no-threads)

source: Repository paths to open on launch.
fr: Chemins des dépôts à ouvrir au lancement.

source: Your preferred Qt binding {0} is not available on this machine. Using {1} instead.
fr: Votre préférence de binding Qt, {0}, n’est pas disponible sur cette machine. {1} sera utilisé à la place.

source: Your preferred Qt binding {0} is not recognized by {app}. Using {1} instead. (Supported values: {known})
fr: Votre préférence de binding Qt, {0}, n’est pas reconnue par {app}. {1} sera utilisé à la place. (Valeurs prises en charge : {known})

source: Qt binding unavailable
fr: Binding Qt indisponible

source: Please open a repository before performing this action.
fr: Veuillez ouvrir un dépôt avant d’appeler cette commande.

source: Unstaged files: will not be included in the commit unless you stage them.
fr: Fichiers non-indexés : ne seront pas inclus dans le commit, à moins que vous ne les indexiez.

source: Stage
fr: Indexer

source: Stage selected files
fr: Indexer les fichiers sélectionnés

source: Discard
fr: Jeter

source: Discard changes in selected files
fr: Jeter les modifications aux fichiers sélectionnés

source: Staged files: will be included in the commit.
fr: Fichiers indexés : seront inclus dans le commit.

source: Unstage
fr: Désindexer

source: Unstage selected files
fr: Désindexer les fichiers sélectionnés

# verb
source: Commit
fr: Committer

source: [Load diff anyway] (this may take a moment)
fr: [Charger la diff malgré tout] (cela peut prendre un certain temps)

source: This file contains very long lines.
fr: Ce fichier contient de très longues lignes.

source: <no newline at end of file>
fr: <sans saut de ligne en fin de fichier>

source: Find text in diff|Find in diff
fr: Rechercher du texte dans la diff|Rech. dans la diff|Rech. dans diff

source: Stage Selection
fr: Indexer la sélection

source: Stage selected lines
fr: Indexer les lignes sélectionnées

source: Unstage Selection
fr: Désindexer la sélection

source: Unstage selected lines
fr: Désindexer les lignes sélectionnées

source: Discard selected lines
fr: Jeter les lignes sélectionnées

source: Export Lines as Patch…
fr: Exporter un correctif de ces lignes…

source: Revert Lines…
fr: Inverser ces lignes…

source: Export Hunk {0} as Patch…
fr: Exporter un correctif de la section {0}…

source: Revert Hunk…
fr: Inverser cette section…

source: Export Hunk as Patch…
fr: Exporter un correctif de cette section…

source: Stage Lines
fr: Indexer ces lignes

source: Discard Lines
fr: Jeter ces lignes

source: Stage Hunk {0}
fr: Indexer la section {0}

source: Discard Hunk
fr: Jeter cette section

source: Unstage Lines
fr: Désindexer ces lignes

source: Unstage Hunk {0}
fr: Désindexer la section {0}

source: &Word Wrap
fr: Retour à la li&gne automatique

source: Configure Appearance…
fr: Configurer l’apparence…

source: Export selected lines
fr: Exporter les lignes sélectionnées

source: Hit {stagekey} to stage the current line, or {discardkey} to discard it.
fr: Tapez {stagekey} pour indexer la ligne courante, ou {discardkey} pour la jeter.

source: Hit {stagekey} to stage the selected lines, or {discardkey} to discard them.
fr: Tapez {stagekey} pour indexer les lignes sélectionnées, ou {discardkey} pour les jeter.

source: Hit {unstagekey} to unstage the current line.
fr: Tapez {unstagekey} pour désindexer la ligne courante.

source: Hit {unstagekey} to unstage the selected lines.
fr: Tapez {unstagekey} pour désindexer les lignes sélectionnées.

source: End of diff reached.
fr: Fin de la diff atteinte.

source: Top of diff reached.
fr: Début de la diff atteint.

source: No more occurrences of {0} found.
fr: Aucune autre occurrence de {0} trouvée.

source: Find in Diff
fr: Rechercher dans la diff

source: Wrap Around
fr: Boucler

source: File contents didn’t change.
fr: Le contenu du fichier n’a pas changé.

source: Empty file was deleted.
fr: Fichier vide supprimé.

source: New empty file.
fr: Nouveau fichier vide.

source: File is empty.
fr: Fichier vide.

source: Renamed:
fr: Renommé :

source: Mode change:
fr: Changement de mode :

source: [Configure diff preview limit] (currently: {0})
fr: [Paramétrer la limite de prévisualisation des diffs] (actuellement : {0})

source: This diff is too large to be previewed.
fr: Cette diff est trop lourde pour être prévisualisée.

source: Diff size: {0}
fr: Taille de la diff : {0}

source: [Load image anyway] (this may take a moment)
fr: [Charger l’image malgré tout] (cela peut prendre un certain temps)

source: [Configure image preview limit] (currently: {0})
fr: [Paramétrer la limite de prévisualisation des images] (actuellement : {0})

source: This image is too large to be previewed.
fr: Cette image est trop lourde pour être prévisualisée.

source: Image size: {0}
fr: Taille de l’image : {0}

source: Old type:
fr: Ancien type :

source: New type:
fr: Nouveau type :

source: This file’s type has changed.
fr: Le type de ce fichier a changé.

source: File appears to be binary.
fr: Ce fichier semble contenir des données binaires.

source: This untracked subtree is the root of another Git repository.
fr: Ce sous-arbre non-suivi constitue la racine d’un autre dépôt Git.

source: Open {0}
fr: Ouvrir {0}

source: Absorb {0} as submodule
fr: Absorber {0} comme sous-module

source: Recommended action:
fr: Action recommandée :

source: Subtree {0} was [removed.]
fr: Le sous-arbre {0} a été [retiré.]

source: Submodule {0} was [removed.]
fr: Le sous-module {0} a été [retiré.]

source: Subtree {0} was [added.]
fr: Le sous-arbre {0} a été [ajouté.]

source: Submodule {0} was [added.]
fr: Le sous-module {0} a été [ajouté.]

source: Subtree {0} was updated.
fr: Le sous-arbre {0} a été mis à jour.

source: Submodule {0} was updated.
fr: Le sous-module {0} a été mis à jour.

source: Subtree {0} contains changes.
fr: Le sous-arbre {0} contient des modifications.

source: Submodule {0} contains changes.
fr: Le sous-module {0} contient des modifications.

source: Open submodule
fr: Ouvrir le sous-module

source: Open subtree
fr: Ouvrir le sous-arbre

source: (path: {0})
fr: (chemin : {0})

source: Old:
fr: Ancien :

source: New:
fr: Nouveau :

source: The subtree’s <b>HEAD</b> has moved to another commit.
fr: La <b>HEAD</b> du sous-arbre a été déplacée sur un autre commit.

source: The submodule’s <b>HEAD</b> has moved to another commit.
fr: La <b>HEAD</b> du sous-module a été déplacée sur un autre commit.

source: You can stage this update:
fr: Vous pouvez indexer cette mise à jour :

source: To complete the removal of this submodule, <b>remove it from {gitmodules}</b>.
fr: Afin d’achever la suppression de ce sous-module, <b>retirez-le de {gitmodules}</b>.

source: To complete the removal of this submodule, make sure to <b>commit {gitmodules}</b> at the same time as the submodule folder itself.
fr: Afin d’achever la suppression de ce sous-module, assurez-vous de committer <b>{gitmodules}</b> en même temps que le dossier du sous-module lui-même.

source: To complete the addition of this submodule, make sure to <b>commit {gitmodules}</b> at the same time as the submodule folder itself.
fr: Afin d’achever l’ajout de ce sous-module, assurez-vous de committer <b>{gitmodules}</b> en même temps que le dossier du sous-module lui-même.

source: <b>This subtree isn’t a submodule yet!</b> You should [absorb this subtree] into the parent repository so it becomes a submodule.
fr: <b>Ce sous-arbre ne constitue pas encore un sous-module !</b> Vous devriez [absorber ce sous-arbre] dans le dépôt parent afin que le sous-arbre devienne un sous-module.

source: To complete the addition of this submodule, you should [absorb the submodule] into the parent repository.
fr: Afin d’achever l’ajout de ce sous-module, vous devriez [absorber le sous-module] dans le dépôt parent.

source: To complete the addition of this submodule, [register it in {gitmodules}].
fr: Afin d’achever l’ajout de ce sous-module, [inscrivez-le dans {gitmodules}].

source: The subtree contains <b>uncommitted changes</b>. They can’t be committed from the parent repo. You can:
fr: Le sous-arbre contient des <b>modifications non-committées</b>. Elles ne peuvent pas être committées directement depuis le dépôt parent. Vous pouvez :

source: [Open] the subtree and commit the changes.
fr: [Ouvrir] le sous-arbre et committer les modifications.

source: Or, [Reset] the subtree to a clean state.
fr: Ou bien [réinitialiser] le sous-arbre à un état propre.

source: The submodule has <b>uncommitted changes</b>. They can’t be committed from the parent repo. You can:
fr: Le sous-module contient des <b>modifications non-committées</b>. Elles ne peuvent pas être committées directement depuis le dépôt parent. Vous pouvez :

source: [Open] the submodule and commit the changes.
fr: [Ouvrir] le sous-module et committer les modifications.

source: Or, [Reset] the submodule to a clean state.
fr: Ou bien [réinitialiser] le sous-module à un état propre.

source: (<b>deleted file</b> displayed below)
fr: (<b>fichier supprimé</b> affiché ci-dessous)

source: (<b>new file</b> displayed below)
fr: (<b>nouveau fichier</b> affiché ci-dessous)

source: Failed to start {tool}
fr: Impossible de lancer {tool}

source: Couldn’t start {command} ({tool}). It might not be installed on your machine.
fr: Impossible de lancer {command} ({tool}). Ce programme n’est peut-être pas installé sur votre machine.

source: Change tool…
fr: Changer d’outil…

source: Locate {tool}…
fr: Localiser {tool}…

source: Where is {tool}?
fr: Où se trouve {tool} ?

source: {tool} isn’t configured in your settings yet.
fr: {tool} n’est pas encore paramétré dans vos réglages.

source: Set up {tool}
fr: Définir {tool}

source: Open Diff in New &Window
fr: Ouvrir la diff dans une &fenêtre détachée

source: &Revert This Change…
fr: &Inverser cette modif…

source: Restor&e File Revision…
fr: &Rétablir le fichier…

source: &As Of This Commit
fr: En l’état à ce &commit

source: &Before This Commit
fr: En l’état avan&t ce commit

source: &Open File in {0}
fr: &Ouvrir le fichier dans {0}

source: &Current Revision (Working Copy)
fr: Révision courante (copie de &travail)

source: &Save a Copy…
fr: Sauve&garder une copie…

source: Submodule
fr: Sous-module

source: Open Submodule in New Tab
fr: &Ouvrir le sous-module dans un nouvel onglet

source: Please review the files individually.
fr: Examinez les fichiers un par un.

source: Open revision before commit
fr: Ouvrir la révision avant le commit

source: Open revision at commit
fr: Ouvrir la révision au commit

source: Really open <b>{n} files</b> in external editor?
fr: Êtes-vous sûr d’ouvrir <b>{n} fichiers</b> dans un éditeur externe ?

source: Save file revision as
fr: Enregistrer la révision du fichier sous

source: Save revision before commit
fr: Enregistrer la révision avant le commit

source: Save revision at commit
fr: Enregistrer la révision au commit

source: Really export <b>{n} files</b>?
fr: Êtes-vous sûr d’exporter <b>{n} fichiers</b> ?

source: This file didn’t exist before the commit.
fr: Ce fichier n’existait pas avant le commit.

source: This file was deleted by the commit.
fr: Ce fichier a été supprimé par le commit.

source: {0}: There’s no file at this path in the working copy.
fr: {0} : Il n’y a pas de fichier à ce chemin dans votre copie de travail.

source: Open working copy revision
fr: Ouvrir la copie de travail

source: Really open <b>{n} files</b>?
fr: Êtes-vous sûr d’ouvrir <b>{n} fichiers</b> ?

source: Open diff in new window
fr: Ouvrir la diff dans une fenêtre détachée

source: Really open <b>{n} windows</b>?
fr: Êtes-vous sûr d’ouvrir <b>{n} fenêtres</b> ?

source: &Stage File
fr: &Indexer le fichier

source: &Discard Changes
fr: &Jeter la modification

source: Merge Conflict
fr: Conflit de fusion

source: Resolve by Accepting “Theirs”
fr: Résoudre en acceptant “leur” version

source: Resolve by Keeping “Ours”
fr: Résoudre en conservant “notre” version

source: Stage Submodule
fr: Indexer le sous-module

source: Discard Changes in Submodule
fr: Jeter modifs dans le sous-module

source: Can’t stage this selection in bulk.
fr: La sélection ne peut pas être indexée en masse.

source: Find a file by path|Find file
fr: Rechercher un fichier par son nom|Rechercher un fichier|Rechercher fichier|Rech. fichier

source: Open &Folder
fr: Ouvrir le &dossier

source: &Copy Path
fr: &Copier le chemin

source: Stas&h Changes…
fr: &Remiser les modifs…

source: Revert Mode Changes
fr: Inverser le changement de mode

source: Revert Mode to Non-Executable
fr: Rétablir le mode Non-Exécutable

source: Revert Mode to Executable
fr: Rétablir le mode Exécutable

source: Open Diff in {0}
fr: Ouvrir la diff dans {0}

source: E&xport Diff As Patch…
fr: E&xporter un correctif de cette diff…

source: &Edit in {tool}
fr: Édit&er dans {tool}

source: Edit &HEAD Version in {tool}
fr: Éditer la version en &HEAD dans {tool}

source: Open in external editor
fr: Ouvrir dans l’éditeur externe

source: Open in external diff tool
fr: Ouvrir dans l’outil de diff externe

source: Really open <b>{n} files</b> in external diff tool?
fr: Êtes-vous sûr d’ouvrir <b>{n} fichiers</b> dans l’outil de diff externe ?

source: {0}: Can’t open external diff tool on a deleted file.
fr: {0} : Impossible d’ouvrir l’outil de diff externe sur un fichier supprimé.

source: {0}: Can’t open external diff tool on a new file.
fr: {0} : Impossible d’ouvrir l’outil de diff externe sur un nouveau fichier.

source: {0}: This file doesn’t exist at this path anymore.
fr: {0} : Ce fichier n’existe plus à ce chemin.

source: Open paths
fr: Ouvrir les chemins

source: Really open <b>{n} folders</b>?
fr: Êtes-vous sûr d’ouvrir <b>{n} dossiers</b> ?

source: This file appears to have been modified by another application. Try refreshing the window.
fr: Le fichier semble avoir été modifié par une autre application. Essayez de rafraîchir la fenêtre.

source: Open HEAD version of file
fr: Ouvrir la version en HEAD du fichier

source: old name
fr: ancien nom

source: new name
fr: nouveau nom

source: name
fr: nom

source: status
fr: état

source: similarity
fr: similarité

source: file mode
fr: mode du fichier

source: size
fr: taille

source: modified
fr: modifié

source: blob id
fr: id du blob

source: Currently viewing diff of staged changes in this file; it also has <u>unstaged</u> changes.
fr: La diff affiche actuellement les modifs indexées de ce fichier ; celui-ci contient également des modifs <u>non-indexées</u>.

source: Currently viewing diff of unstaged changes in this file; it also has <u>staged</u> changes.
fr: La diff affiche actuellement les modifs non-indexées de ce fichier ; celui-ci contient également des modifs <u>indexées</u>.

source: &Unstage File
fr: &Désindexer le fichier

source: Unstage Submodule
fr: Désindexer le sous-module

source: Can’t unstage this selection in bulk.
fr: La sélection ne peut pas être désindexée en masse.

source: If {app} helps you get work done, please consider [making a small donation].
fr: Si {app} vous facilite la vie, veuillez envisager de faire [un petit don].

source: Thank you for your support!
fr: Merci pour votre soutien !

source: Powered by:
fr: Fonctionne avec :

source: Special thanks to Marc-Alexandre Espiaut for beta testing.
fr: Remerciements spéciaux à Marc-Alexandre Espiaut pour le bêta-test.

source: Portions of this software are based on [{lib}], used under [{lic} license], {copyright}.
fr: Des portions de ce logiciel sont basées sur [{lib}], utilisées sous [licence {lic}], {copyright}.

source: Dismiss
fr: OK

source: Check out commit {0}
fr: Basculer dans le commit {0}

source: Detach HEAD
fr: Détacher HEAD

source: Switch Branch
fr: Basculer

source: Create Branch…
fr: Nouvelle branche…

source: Reset default clone location
fr: Réinitialiser le lieu de clonage par défaut

source: C&lone
fr: C&loner

source: Hit {0} when ready.
fr: Cliquez sur {0} lorsque vous êtes prêt.

source: Please fill in this field.
fr: Veuillez remplir ce champ.

source: Please enter an absolute path.
fr: Veuillez saisir un chemin absolu.

source: There’s already a file at this path.
fr: Un fichier existe déjà à cet endroit.

source: This directory isn’t empty.
fr: Ce répertoire n’est pas vide.

source: Set current location as default clone location
fr: Définir le lieu actuel comme lieu de clonage par défaut

source: {0} is the default clone location
fr: {0} est le lieu de clonage par défaut

source: Set {0} as default clone location
fr: Définir {0} comme lieu de clonage par défaut

source: Clear history
fr: Effacer l’historique

source: &Shallow clone
fr: Clone &superficiel

source: &Shallow clone: Fetch up to {n} commit per branch
fr: Clone &superficiel : Récupérer jusqu’à {n} commit par branche

source: Clone repository into
fr: Cloner le dépôt dans

source: Clone here
fr: Cloner ici

source: Contacting remote host…
fr: Connexion au serveur…

source: Cloning…
fr: Clone en cours…

source: Initializing submodule {0}: {1}…
fr: Initialisation du sous-module {0} : {1}…

source: Amend commit message
fr: Rectifier le message du commit

source: A&mend
fr: &Rectifier

source: Amend Commit {0}
fr: Rectifier le commit {0}

source: Enter commit summary
fr: Saisir le résumé du commit

source: Co&mmit
fr: Co&mmitter

source: This commit will conclude the merge.
fr: Ce commit conclura la fusion.

source: This commit will conclude the cherry-pick.
fr: Ce commit conclura le picorage.

source: This commit will conclude the revert.
fr: Ce commit conclura l’inversion.

source: You are amending commit {0}.
fr: Vous êtes en train de rectifier le commit {0}.

source: <b>Detached HEAD</b> – You are not in any branch! You should create a branch to keep track of your commit.
fr: <b>HEAD détachée</b> – Vous n’êtes sur aucune branche ! Vous devriez créer une branche pour éviter de perdre votre commit par inadvertance.

source: You are creating an empty commit (no staged changes).
fr: Vous êtes en train de créer un commit vide (aucune modification indexée).

source: Cannot be empty.
fr: Ne peut être vide.

source: Authored by:
fr: Auteur :

source: (overridden manually)
fr: (remplacé manuellement)

source: Committed by:
fr: Committeur :

source: Waiting for you to finish merging this file in {0} (PID {1})…
fr: Veuillez achever la fusion de ce fichier dans {0} (PID {1})…

source: This file has received changes from both <i>our</i> branch and <i>their</i> branch.
fr: Ce fichier a reçu des modifications à la fois dans <i>notre</i> branche et dans <i>la leur</i>.

source: Keep OURS
fr: Conserver LA NÔTRE

source: Accept THEIRS
fr: Accepter LA LEUR

source: Resolve the conflict by <b>rejecting incoming changes</b>.
fr: Résoudre le conflit en <b>rejetant les modifications entrantes</b>.

source: The file will remain unchanged from its state in HEAD.
fr: Le fichier restera inchangé par rapport à son état en HEAD.

source: Resolve the conflict by <b>accepting incoming changes</b>.
fr: Résoudre le conflit en <b>acceptant les modifications entrantes</b>.

source: The file will be <b>replaced</b> with the incoming version.
fr: Le fichier sera <b>remplacé</b> par la version entrante.

source: This file was deleted from <i>our</i> branch, but <i>their</i> branch kept it and made changes to it.
fr: Ce fichier a été supprimé de <i>notre</i> branche, tandis que <i>leur</i> branche l’a conservé et y a apporté des modifications.

source: Keep OUR deletion
fr: Conserver NOTRE suppression

source: Accept THEIR version
fr: Accepter LEUR version

source: The file won’t be added back to your branch.
fr: Le fichier ne sera pas rajouté à votre branche.

source: The file will be restored to your branch with the incoming changes.
fr: Le fichier sera rajouté à votre branche avec les modifications entrantes.

source: We’ve made changes to this file in <i>our</i> branch, but <i>their</i> branch has deleted it.
fr: Nous avons modifié ce fichier dans <i>notre</i> branche, mais <i>leur</i> branche l’a supprimé.

source: Accept deletion
fr: Accepter la suppression

source: Resolve the conflict by <b>rejecting the incoming deletion</b>.
fr: Résoudre le conflit en <b>rejetant la suppression entrante</b>.

source: Our version of the file will be kept intact.
fr: Notre version du fichier restera intacte.

source: Resolve the conflict by <b>accepting the incoming deletion</b>.
fr: Résoudre le conflit en <b>acceptant la suppression entrante</b>.

source: The file will be deleted.
fr: Le fichier sera supprimé.

source: No common ancestor.
fr: Pas d’ancêtre commun.

source: Delete it
fr: Le supprimer

source: Don’t add
fr: Ne pas ajouter

source: This file has been created in both <i>our</i> branch and <i>their</i> branch, independently from each other. There is no common ancestor.
fr: Ce fichier a été créé à la fois dans <i>notre</i> branche et <i>la leur</i>, indépendamment l’une de l’autre. Il n’y a pas d’ancêtre commun.

source: The file was deleted from <i>our</i> branch, and <i>their</i> branch has deleted it too.
fr: Le fichier a été supprimé de <i>notre</i> branche, et <i>leur</i> branche l’a également supprimé.

source: Maximize
fr: Maximiser

source: Maximize the diff area and hide the commit graph
fr: Maximiser la zone de diff et masquer le graphe de commits

# noun
source: Stash
fr: Remise

source: Show details about this commit
fr: Afficher davantage d’informations sur ce commit

source: Show details about this stash
fr: Afficher davantage d’informations sur cette remise

source: Delete
fr: Supprimer

source: Delete this stash
fr: Supprimer cette remise

source: Apply
fr: Appliquer

source: Apply this stash
fr: Appliquer cette remise

source: Uncommitted changes
fr: Modifications non-committées

source: &Delete Locally
fr: &Supprimer localement

source: &Delete Locally && Remotely
fr: &Suppr. localement && sur serveur

source: Delete tag {0}
fr: Supprimer l’étiquette {0}

source: Tagged commit: {0}
fr: Commit étiqueté : {0}

source: This information will be embedded in the commits and tags that you create on this machine.
fr: Ces informations seront incluses dans les commits et les étiquettes que vous créerez sur cette machine.

source: Before editing this repository, please set up your identity for Git.
fr: Avant d’agir sur ce dépôt, veuillez renseigner votre identité pour Git.

source: {app} normally uses public/private keys in {path} to authenticate you with remote servers.
fr: {app} utilise normalement les clés publiques/privées dans {path} pour vous authentifier auprès de serveurs distants.

source: Tick this box if you want to access this remote with a custom key.
fr: Cochez cette case si vous souhaitez accéder à ce serveur à l’aide d’une clé spéciale.

source: Select public key file for this remote
fr: Sélectionnez la clé publique à utiliser sur ce serveur

source: Public key file
fr: Fichier de clé publique

source: File not found.
fr: Fichier introuvable.

source: Accompanying private key not found.
fr: La clé privée associée est introuvable.

source: Accompanying public key not found.
fr: La clé publique associée est introuvable.

source: Show toolbar
fr: Afficher la barre d’outils

source: Open…
fr: Ouvrir…

source: Open a Git repo on your machine
fr: Ouvrir un dépôt Git sur votre machine

source: Reveal
fr: Révéler

source: Open repo folder in file manager
fr: Ouvrir le dossier du dépôt dans le gestionnaire de fichiers
